# -*- encoding:utf-8 -*-
'''
@describe: 
@author: Li Anbang
@Create Date: 2024/2/25 上午8:44
'''

tables = [
    'a_sap_employee_information_chinese(人员工号 (每个员工的唯一工号，也是这张表的主键), 姓名, 雇佣状态 (值为：["在职","离职"]), 职位, 入职日期, 部门负责人 (该员工所属部门（一级机构）的负责人姓名), 人事范围 (值为：["Ampack-DG","SSL","SZ","Poweramp","Ampack","BM","HK","ND","Ampace"]), 员工组 (值为：["劳务外包","试用","退休返聘","CJR","劳务派遣-正式","正式","劳务派遣-试用","顾问","实习"]), 员工子组文本 (值为：["顾问","实习","二级员工","五级员工","一级员工","三级员工","CJR","四级员工"]), 上班地点 (值为：["SSL","SZ(深圳)","WX(无锡)","XM","IN","BM","HK","SG","MNO","ND","SSL-P"]), 英文名, 性别, 国籍, 民族, 籍贯, 身份证地址的省_直辖市, 开始参加工作日期, 员工本人联系号码, 一级机构 (也称为部门，值一般为英文字母组成，例如：["IDT","APD","HR","QA","FE"]等), 二级机构 (也称为组，是部门下分组，例如：["AI","AD","CPA","TA"]等等), 三级机构 (也称为组，是二级机构下面的更细分的小组，例如：["EMC","IPQC","PH","EP-M"]等等), 职务名称, 员工工作性质文本 (值为：["兼职-不计算","劳务外包","兼职-计算","全职-计算","挂职"]), 直属上司工号, 直属上司姓名, 集团入职日期), and table comment: 这个是公司每个员工基本信息表。',
    'a_sap_employee_education_experience_chinese(人员工号 (每个员工的唯一工号，也是这张表的主键), 姓名, 开始日期 (受教育的开始日期), 结束日期 (受教育的结束日期), 学历 (值：["硕士","高中","大学专科","博士","初中及以下","大学本科","中专"]), 教育类型, 院校_培训机构, 国家, 证书, 第一专业), and table comment: 这个是公司每个员工受教育经历的数据表。',
    'a_sap_staffing_recruitment_plan_chinese(编制年度 (公司的财年，值为"TXXX",其中XXX是数字，例如:["T126","T127","T128"]), 编制月度 (公司财年中的月度，值有:[1,2,3,4,...,12]), 员工子组 (员工等级组别，值有["A1","A2","A3","A4","A5"]，其中A5级别最高), 有效编制空缺, 创建日期, 年度可申请空缺数量, 季度可申请空缺数量, 月度可申请空缺数量, 年度编制数量, 季度编制数量, 月度编制数量, 特批编制数量, 拟在职人数, 有效但是没有报到空缺数, 写入日期, open数, 关闭数, 冻结数, 集团名称, 一级机构 (也称为部门，值一般为英文字母组成，例如：["IDT","APD","HR","QA","FE"]等), 二级机构 (也称为组，是部门下分组，例如：["AI","AD","CPA","TA"]等等), 三级机构 (也称为组，是二级机构下面的更细分的小组，例如：["EMC","IPQC","PH","EP-M"]等等), 职级范围), and table comment: 这个是公司各个部门（一级机构），小组（二级机构、三级机构），在每个编制年度(财年)/编制月度的招聘计划表。',
    'a_sap_positions_responsibilities_risks_chinese(集团, 一级机构 (也称为部门，值一般为英文字母组成，例如：["idt","apd","hr","qa","fe"]等), 二级机构 (也称为组，是部门下分组，例如：["ai","ad","cpa","ta"]等等), 三级机构 (也称为组，是二级机构下面的更细分的小组，例如：["emc","ipqc","ph","ep-m"]等等), 职位, 成本类别名称 (岗位的成本类别，值有：["mgr.above","idl","staff","dl"]), 岗位名称, 岗位属性名称, 角色定位, 岗位风险点, 岗位职责, 岗位任职资格, 绩效贡献, 经验及其他资质要求, 部门职能类型名称 (值有：["工程","研发","运营","支持","销售","质量","其它","atl"]), 职务, 职务类型 (值为：["p1-技术类","f4-文职类","技术类","实习","f2-操作类","p2-非技术类","m-管理类","f3-现场管理类","f1-现场技术类"]), 现职人数), and table comment: 这个是公司每个岗位的责任和风险，以及绩效贡献标准等等表。',
    'a_sap_performance_ai(编制年度 (公司财年), 姓名, 人员工号, 绩效 (绩效排序（好->差）:["A","B+","B","B-","C","D"])), and table comment: 这个是公司每个员工每个财年的绩效表',
    'a_sap_reporting_relationship_chinese(开始日期 (汇报关系开始的时间), 结束日期 (汇报关系结束的时间), 人员工号 (该表主键，每个员工的唯一id值。), 姓名, 入司日期, 工作性质 (值为：["全职-计算","挂职","兼职-不计算","劳务外包"]), 一级机构 (也称为部门，值一般为英文字母组成，例如：["idt","apd","hr","qa","fe"]等), 二级机构 (也称为组，是部门下分组，例如：["ai","ad","cpa","ta"]等等), 三级机构 (也称为组，是二级机构下面的更细分的小组，例如：["emc","ipqc","ph","ep-m"]等等), 是否管理机构 (该员工是否是部门（一级机构），小组（二级机构，三级机构）负责人。值为：["是","否"]), 主管1姓名, 主管1职位, 主管1职务, 主管2姓名, 主管2职位, 主管2职务, 经理1姓名, 经理1职位, 经理1职务, 经理2姓名, 经理2职位, 经理2职务, 经理3姓名, 经理3职位, 经理3职务, 经理4姓名, 经理4职位, 经理4职务, 总监1姓名, 总监1职位, 总监1职务, 总监2姓名, 总监2职位, 总监2职务, 总监3姓名, 总监3职位, 总监3职务, 总监4姓名, 总监4职位, 总监4职务, 一级机构负责人姓名, 一级机构负责人职位, 一级机构负责人职务), and table comment: 这个是公司每个员工汇报关系表。',

]

from FlagEmbedding import FlagReranker

reranker = FlagReranker('/datas/liab/rerank_model/bge-reranker-large',
                        use_fp16=True)  # Setting use_fp16 to True speeds up computation with a slight performance degradation
query = '请问李安榜在T127年的绩效是怎样的？'

pairs = []
for i in tables:
    node = []
    node.append(query)
    node.append(i)
    pairs.append(node)

score = reranker.compute_score(pairs)
print(score)
