Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_rag.po
Languages: fr, ja, ru

source: Default Embeddings
fr: Embeddings par défaut
ja: デフォルトの埋め込み
ru: Эмбеддинги по умолчанию

source: Default embeddings(using default embedding model of current system)
fr: Embeddings par défaut (utilisant le modèle d'embedding par défaut du système actuel)
ja: デフォルトの埋め込み (現在のシステムのデフォルトの埋め込みモデルを使用)
ru: Эмбеддинги по умолчанию (используется модель эмбеддинга по умолчанию текущей системы)

source: The path of the model, if you want to deploy a local model.
fr: Le chemin du modèle, si vous souhaitez déployer un modèle local.
ja: ローカルモデルを展開する場合のモデルのパス
ru: Путь к модели, если вы хотите развернуть локальную модель.

source: Device to run model. If None, the device is automatically determined
fr: Périphérique pour exécuter le modèle. Si None, le périphérique est automatiquement déterminé
ja: モデルを実行するデバイス。None の場合は、デバイスが自動的に決定されます
ru: Устройство для запуска модели. Если не указано, устройство определяется автоматически

source: Path of the cache folder.
fr: Chemin du dossier de cache.
ja: キャッシュフォルダのパス
ru: Путь к папке кэша.

source: Normalize embeddings.
fr: Normaliser les embeddings.
ja: 埋め込みを正規化する
ru: Нормализовать эмбеддинги.

source: Run encode() on multiple GPUs.
fr: Exécuter encode() sur plusieurs GPU.
ja: 複数の GPU で encode() を実行する
ru: Запустить функцию encode() на нескольких графических процессорах.

source: Keyword arguments to pass to the model.
fr: Arguments clés à passer au modèle.
ja: モデルに渡すキーワード引数
ru: Ключевые аргументы, передаваемые модели.

source: Keyword arguments to pass when calling the `encode` method.
fr: Arguments clés à passer lors de l'appel de la méthode `encode`.
ja: `encode` メソッドを呼び出す際に渡すキーワード引数
ru: Ключевые аргументы, передаваемые при вызове метода `encode`.

source: Instruction to use for embedding documents. Just for Instructor model.
fr: Instruction à utiliser pour l'encodage des documents. Uniquement pour le modèle Instructor.
ja: ドキュメントの埋め込みに使用する指示。Instructorモデル専用です
ru: Инструкция для эмбеддинга документов. Только для модели Instructor.

source: Instruction to use for embedding query. Just for Instructor model.
fr: Instruction à utiliser pour l'encodage de la requête. Uniquement pour le modèle Instructor.
ja: クエリの埋め込みに使用する指示。Instructorモデル専用です
ru: Инструкция для эмбеддинга запроса. Только для модели Instructor.

source: HuggingFace Embeddings
fr: Embeddings HuggingFace
ja: HuggingFace 埋め込み表現
ru: Эмбеддинги HuggingFace

source: HuggingFace sentence_transformers embedding models.
fr: Modèles d'encodage HuggingFace sentence_transformers.
ja: HuggingFaceのsentence_transformers埋め込みモデル
ru: Модели эмбеддинга HuggingFace sentence_transformers.

source: Model Name
fr: Nom du modèle
ja: モデル名
ru: Название модели

source: Model name to use.
fr: Nom du modèle à utiliser.
ja: 使用するモデルの名前
ru: Название модели для использования.

source: HuggingFace Instructor Embeddings
fr: Embeddings HuggingFace Instructor
ja: HuggingFace インストラクター埋め込み
ru: Векторные представления HuggingFace Instructor

source: HuggingFace Instructor embeddings.
fr: Embeddings HuggingFace Instructor.
ja: HuggingFace インストラクター埋め込み。
ru: Векторные представления HuggingFace Instructor.

source: Embed Instruction
fr: Instruction d'encodage
ja: 埋め込み指示
ru: Инструкция по встраиванию

source: Instruction to use for embedding documents.
fr: Instruction à utiliser pour l'embedding de documents.
ja: ドキュメントを埋め込むために使用する指示。
ru: Инструкция для встраивания документов.

source: Query Instruction
fr: Instruction de requête
ja: クエリ指示
ru: Инструкция по запросу

source: Instruction to use for embedding query.
fr: Instruction à utiliser pour l'embedding de requête.
ja: クエリを埋め込むために使用する指示。
ru: Инструкция для встраивания запроса.

source: HuggingFace Inference API Embeddings
fr: Embeddings de l'API d'inférence HuggingFace
ja: HuggingFace 推論 API 埋め込み
ru: Векторные представления HuggingFace Inference API

source: HuggingFace Inference API embeddings.
fr: Embeddings de l'API d'inférence HuggingFace.
ja: HuggingFace 推論 API 埋め込み。
ru: Векторные представления HuggingFace Inference API.

source: API Key
fr: Clé API
ja: API キー
ru: API-ключ

source: Your API key for the HuggingFace Inference API.
fr: Votre clé API pour l'API d'inférence HuggingFace.
ja: HuggingFace 推論 API のあなたの API キー。
ru: Ваш API-ключ для HuggingFace Inference API.

source: The name of the model to use for text embeddings.
fr: Le nom du modèle à utiliser pour les embeddings de texte.
ja: テキスト埋め込みに使用するモデルの名前。
ru: Название модели, используемой для текстовых эмбеддингов.

source: The URL of the embeddings API.
fr: L'URL de l'API d'embeddings.
ja: 埋め込み API の URL。
ru: URL-адрес API эмбеддингов.

source: The API key for the embeddings API.
fr: La clé API pour l'API d'embeddings.
ja: 埋め込み API の API キー。
ru: API-ключ для API эмбеддингов.

source: The real model name to pass to the provider, default is None. If backend is None, use name as the real model name.
fr: Le nom réel du modèle à transmettre au fournisseur, la valeur par défaut est None. Si le backend est None, utilisez le nom comme nom réel du modèle.
ja: プロバイダーに渡す実際のモデル名で、デフォルトは None です。バックエンドが None の場合、名前を実際のモデル名として使用します。
ru: Реальное название модели, которое нужно передать провайдеру, по умолчанию None. Если бэкенд равен None, использовать название в качестве реального названия модели.

source: The timeout for the request in seconds.
fr: Le délai d'attente pour la requête en secondes.
ja: リクエストのタイムアウト時間（秒）。
ru: Тайм-аут запроса в секундах.

source: OpenAPI Embeddings
fr: Embeddings OpenAPI
ja: OpenAPI 埋め込み
ru: OpenAPI эмбеддинги

source: OpenAPI embeddings.
fr: Embeddings OpenAPI.
ja: OpenAPI 埋め込み。
ru: OpenAPI эмбеддинги.

source: API URL
fr: URL de l'API
ru: URL-адрес API

source: Your API key for the Open API.
fr: Votre clé API pour l'API Open.
ja: Open API 用のあなたの API キーです。
ru: Ваш API-ключ для Open API.

source: Timeout
fr: Délai d'attente
ja: タイムアウト
ru: Тайм-аут

source: The GTE models are trained by Alibaba DAMO Academy, supporting Chinese.
fr: Les modèles GTE sont entraînés par l'Académie DAMO d'Alibaba et prennent en charge le chinois.
ja: GTE モデルはアリババダモアカデミーによって訓練され、中国語に対応しています。
ru: Модели GTE были обучены Академией DAMO Alibaba и поддерживают китайский язык.

source: The GTE models are trained by Alibaba DAMO Academy, supporting English.
fr: Les modèles GTE sont entraînés par l'Académie DAMO d'Alibaba et prennent en charge l'anglais.
ja: GTE モデルはアリババダモアカデミーによって訓練され、英語に対応しています。
ru: Модели GTE были обучены Академией DAMO Alibaba и поддерживают английский язык.

source: The embedding model are trained by MokaAI, this version support English and Chinese.
fr: Le modèle d'embedding est entraîné par MokaAI. Cette version prend en charge l'anglais et le chinois.
ja: この埋め込みモデルは MokaAI によって訓練され、このバージョンでは英語と中国語に対応しています。
ru: Модель эмбеддинга была обучена MokaAI. Эта версия поддерживает английский и китайский языки.

source: The embedding model are trained by MokaAI, this version support Chinese.
fr: Le modèle d'embedding est entraîné par MokaAI. Cette version prend en charge le chinois.
ja: この埋め込みモデルは MokaAI によって訓練され、このバージョンでは中国語に対応しています。
ru: Модель эмбеддинга была обучена MokaAI. Эта версия поддерживает китайский язык.

source: The embedding model are trained by HKUNLP, it support English.
fr: Le modèle d'embedding est entraîné par HKUNLP et prend en charge l'anglais.
ja: この埋め込みモデルは香港大学自然言語処理研究室 (HKUNLP) によって訓練され、英語に対応しています。
ru: Модель эмбеддинга была обучена HKUNLP и поддерживает английский язык.

source: The embedding model are trained by OpenAI, it support English.
fr: Le modèle d'embedding est entraîné par OpenAI et prend en charge l'anglais.
ja: この埋め込みモデルは OpenAI によって訓練され、英語に対応しています。
ru: Модель эмбеддинга была обучена OpenAI и поддерживает английский язык.

source: Max length for input sequences. Longer sequences will be truncated.
fr: Longueur maximale pour les séquences d'entrée. Les séquences plus longues seront tronquées.
ja: 入力シーケンスの最大長です。より長いシーケンスは切り捨てられます。
ru: Максимальная длина входных последовательностей. Более длинные последовательности будут усечены.

source: The URL of the rerank API.
fr: L'URL de l'API de rerank.
ja: リランク API の URL です。
ru: URL API переранжирования.

source: The API key for the rerank API.
fr: La clé API pour l'API de rerank.
ja: リランク API の API キーです。
ru: Ключ API для API переранжирования.

source: Chunk Manager Operator
fr: Opérateur de gestion des chunks
ja: チャンクマネージャオペレーター
ru: Оператор менеджера чанков

source: Split Knowledge Documents into chunks.
fr: Diviser les documents de connaissance en chunks.
ja: 知識ドキュメントをチャンクに分割します。
ru: Разделить документы с знаниями на чанки.

source: Chunk Split Parameters
fr: Paramètres de division des segments
ja: チャンク分割パラメータ
ru: Параметры разделения на чанки

source: Chunk Split Parameters.
fr: Paramètres de division des segments.
ja: チャンク分割パラメータ。
ru: Параметры разделения на чанки.

source: Knowledge
fr: Connaissance
ja: 知識
ru: Знания

source: The knowledge to be loaded.
fr: La connaissance à charger.
ja: 読み込む知識。
ru: Знания, которые необходимо загрузить.

source: Chunks
fr: Segments
ja: チャンク
ru: Чанки

source: The split chunks by chunk manager.
fr: Les segments divisés par le gestionnaire de segments.
ja: チャンクマネージャーによって分割されたチャンク。
ru: Чанки, разделенные менеджером чанков.

source: Query Rewrite Operator
fr: Opérateur de réécriture de requête
ja: クエリ書き換えオペレーター
ru: Оператор перезаписи запроса

source: Query rewrite operator.
fr: Opérateur de réécriture de requête.
ja: クエリ書き換えオペレーター。
ru: Оператор перезаписи запроса.

source: Query context
fr: Contexte de la requête
ja: クエリコンテキスト
ru: Контекст запроса

source: query context
fr: contexte de la requête
ja: クエリコンテキスト
ru: Контекст запроса

source: Rewritten queries
fr: Requêtes réécrites
ja: 書き換えられたクエリ
ru: Перезаписанные запросы

source: LLM Client
fr: Client LLM
ja: LLM クライアント
ru: LLM 客户端

source: The LLM Client.
fr: Le client LLM.
ja: LLM クライアント。
ru: LLM 客户端。

source: Model name
fr: Nom du modèle
ja: モデル名
ru: Название модели

source: LLM model name.
fr: Nom du modèle LLM.
ja: LLM モデル名。
ru: Название LLM модели.

source: Prompt language
fr: Langue du prompt
ja: プロンプト言語
ru: Язык промпта

source: Prompt language.
fr: Langue du prompt.
ja: プロンプト言語。
ru: Язык промпта.

source: Number of results
fr: Nombre de résultats
ja: 結果の数
ru: Количество результатов

source: rewrite query number.
fr: nombre de requêtes réécrites.
ja: クエリの書き換え数。
ru: Число перезаписанных запросов.

source: Character Text Splitter
fr: Séparateur de texte par caractères
ja: 文字単位のテキスト分割器
ru: Разделитель текста по символам

source: Separator
fr: Séparateur
ja: セパレーター
ru: Разделитель

source: Separator to split the text.
fr: Séparateur pour diviser le texte.
ja: テキストを分割するためのセパレーター。
ru: Разделитель для разделения текста.

source: Recursive Character Text Splitter
fr: Séparateur de texte récursif par caractères
ja: 再帰的キャラクターテキスト分割器
ru: Рекурсивный разделитель текста по символам

source: Split text by characters recursively.
fr: Diviser le texte par caractères de manière récursive.
ja: 文字を再帰的に使用してテキストを分割します。
ru: Разделить текст по символам рекурсивно.

source: Spacy Text Splitter
fr: Séparateur de texte Spacy
ja: Spacy テキスト分割器
ru: Разделитель текста Spacy

source: Pipeline
ja: パイプライン
ru: Конвейер

source: Spacy pipeline to use for tokenization.
fr: Pipeline Spacy à utiliser pour la tokenisation.
ja: トークナイゼーションに使用する Spacy パイプライン。
ru: Конвейер Spacy для токенизации.

source: Split text by sentences using Spacy.
fr: Diviser le texte en phrases en utilisant Spacy.
ja: Spacy を使用して文でテキストを分割します。
ru: Разделить текст на предложения с использованием Spacy.

source: Markdown Header Text Splitter
fr: Séparateur de texte par en-têtes Markdown
ja: Markdown 見出しテキスト分割器
ru: Разделитель текста по заголовкам Markdown

source: Return Each Line
fr: Retourner chaque ligne
ja: 各行を返す
ru: Вернуть каждую строку

source: Return each line with associated headers.
fr: Retourner chaque ligne avec les en-têtes associés.
ja: 関連するヘッダー付きで各行を返します。
ru: Вернуть каждую строку с соответствующими заголовками.

source: Chunk Size
fr: Taille du morceau
ja: チャンクサイズ
ru: Размер фрагмента

source: Size of each chunk.
fr: Taille de chaque morceau.
ja: 各チャンクのサイズ。
ru: Размер каждого фрагмента.

source: Chunk Overlap
fr: Chevauchement des morceaux
ja: チャンクの重複
ru: Перекрытие фрагментов

source: Overlap between chunks.
fr: Chevauchement entre les morceaux.
ja: チャンク間の重複。
ru: Перекрытие между фрагментами.

source: Split markdown text by headers.
fr: Diviser le texte Markdown par en-têtes.
ja: 見出しによって Markdown テキストを分割します。
ru: Разделить текст Markdown по заголовкам.

source: Separator Text Splitter
fr: Séparateur de texte par séparateur
ja: セパレーターテキスト分割器
ru: Разделитель текста по разделителям

source: Split text by separator.
fr: Diviser le texte par séparateur.
ja: セパレーターを使用してテキストを分割します。
ru: Разделить текст по разделителю.

source: Page Text Splitter
fr: Séparateur de texte par page
ja: ページテキスト分割器
ru: Разделитель текста по страницам

source: Split text by page.
fr: Diviser le texte par page.
ja: ページごとにテキストを分割します。
ru: Разделить текст по страницам.

source: Query Rewrite
fr: Réécriture de requête
ja: クエリの書き換え
ru: Перезапись запроса

source: Query rewrite.
fr: Réécriture de requête.
ja: クエリの書き換え。
ru: Перезапись запроса.

source: The LLM model name.
fr: Le nom du modèle LLM.
ja: LLM モデルの名前。
ru: Название модели LLM.

source: The llm client.
fr: Le client LLM.
ja: LLM クライアント。
ru: Клиент LLM.

source: Language
fr: Langue
ja: 言語
ru: Язык

source: The language of the query rewrite prompt.
fr: La langue de l'invite de réécriture de la requête.
ja: クエリの書き換えプロンプトの言語。
ru: Язык запроса для перезаписи подсказки.

source: Default Ranker
fr: Classificateur par défaut
ja: デフォルトランカー
ru: Ранжировщик по умолчанию

source: Default ranker(Rank by score).
fr: Classificateur par défaut (Classement par score).
ja: デフォルトランカー（スコアによるランキング）。
ru: Ранжировщик по умолчанию (Ранжирование по баллам).

source: Top k
ja: 上位 k
ru: Топ k

source: The number of top k documents.
fr: Le nombre de documents top k.
ja: 上位 k のドキュメント数。
ru: Количество топ k документов.

source: CrossEncoder Rerank
fr: Reclassement CrossEncoder
ja: クロスエンコーダー再ランキング
ru: Переранжирование с использованием кросс-кодировщика

source: CrossEncoder ranker.
fr: Classificateur CrossEncoder.
ja: クロスエンコーダーランカー。
ru: Ранжировщик CrossEncoder.

source: Rerank Model
fr: Modèle de reclassement
ja: 再ランキングモデル
ru: Модель переранжирования

source: rerank model name, e.g., 'BAAI/bge-reranker-base'.
fr: Nom du modèle de reclassement, par exemple 'BAAI/bge-reranker-base'.
ja: 再ランキングモデルの名前、例：'BAAI/bge-reranker-base'。
ru: Название модели переранжирования, например, 'BAAI/bge-reranker-base'.

source: device
fr: Appareil
ja: デバイス
ru: устройство

source: device name, e.g., 'cpu'.
fr: Nom de l'appareil, par exemple 'cpu'.
ja: デバイス名、例：'cpu'。
ru: имя устройства, например, 'cpu'.
