Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_client__cli.po
Languages: fr, ja, ko, ru, zh_cn

source: The path of the AWEL flow
fr: Le chemin du flux AWEL
ja: AWELフローのパス
ko: AWEL 흐름의 경로
ru: Путь к AWEL flow
zh_cn: AWEL 工作流的路径

source: The name of the AWEL flow
fr: Le nom du flux AWEL
ja: AWELフローの名前
ko: AWEL 흐름의 이름
ru: Название AWEL flow
zh_cn: AWEL 工作流的名称

source: The uid of the AWEL flow
fr: L'UID du flux AWEL
ja: AWELフローのUID
ko: AWEL 흐름의 고유 식별자
ru: UID AWEL flow
zh_cn: AWEL 工作流的 UID

source: The messages to run AWEL flow
fr: Les messages pour exécuter le flux AWEL
ja: AWELフローを実行するためのメッセージ
ko: AWEL 흐름을 실행할 메시지
ru: Сообщения для запуска AWEL flow
zh_cn: 用于运行 AWEL 工作流的消息

source: The model name of AWEL flow
fr: Le nom du modèle du flux AWEL
ja: AWELフローのモデル名
ko: AWEL 흐름의 모델 이름
ru: Название модели AWEL flow
zh_cn: AWEL 工作流的模型名称

source: Whether use stream mode to run AWEL flow
fr: Si l'on doit utiliser le mode stream pour exécuter le flux AWEL
ja: AWELフローをストリームモードで実行するかどうか
ko: AWEL 흐름을 실행할 때 스트림 모드를 사용할지 여부
ru: Использовать ли потоковый режим для запуска AWEL flow
zh_cn: 是否使用流模式运行 AWEL 工作流

source: The temperature to run AWEL flow
fr: La température pour exécuter le flux AWEL
ja: AWELフローを実行する際の温度設定
ko: AWEL 흐름을 실행할 때의 온도
ru: Температура для запуска AWEL flow
zh_cn: 运行 AWEL 工作流的温度参数

source: The max new tokens to run AWEL flow
fr: Le nombre maximum de nouveaux tokens pour exécuter le flux AWEL
ja: AWELフローを実行する際の最大新トークン数
ko: AWEL 흐름을 실행할 때의 최대 새 토큰 수
ru: Максимальное количество новых токенов для запуска AWEL flow
zh_cn: 运行 AWEL 工作流的最大新 Token 数

source: The conversation id of the AWEL flow
fr: L'ID de conversation du flux AWEL
ja: AWELフローの会話ID
ko: AWEL 흐름의 대화 ID
ru: ID разговора AWEL flow
zh_cn: AWEL 工作流的对话 ID

source: The json data to run AWEL flow, if set, will overwrite other options
fr: Les données JSON pour exécuter le flux AWEL, si elles sont définies, écraseront les autres options
ja: AWELフローを実行するためのJSONデータ。設定すると、他のオプションを上書きします。
ko: AWEL 흐름을 실행할 JSON 데이터. 설정하면 다른 옵션을 덮어씁니다.
ru: JSON-данные для запуска AWEL flow. Если установлены, перезапишут другие параметры
zh_cn: 用于运行 AWEL 工作流的 JSON 数据，如果设置，将覆盖其他选项

source: The extra json data to run AWEL flow.
fr: Les données JSON supplémentaires pour exécuter le flux AWEL.
ja: AWELフローを実行するための追加のJSONデータ。
ko: AWEL 흐름을 실행할 추가 JSON 데이터.
ru: Дополнительные JSON-данные для запуска AWEL flow.
zh_cn: 用于运行 AWEL 工作流的额外 JSON 数据。

source: Whether use interactive mode to run AWEL flow
fr: Si l'on doit utiliser le mode interactif pour exécuter le flux AWEL
ja: AWELフローをインタラクティブモードで実行するかどうか
ko: AWEL 흐름을 실행할 때 대화형 모드를 사용할지 여부
ru: Использовать ли интерактивный режим для запуска AWEL flow
zh_cn: 是否使用交互模式运行 AWEL 工作流

source: The output key of the AWEL flow, if set, it will try to get the output by the key
fr: La clé de sortie du flux AWEL, si elle est définie, le système tentera d'obtenir la sortie à l'aide de cette clé
ja: AWELフローの出力キー。設定すると、そのキーで出力を取得しようとします。
ko: AWEL 흐름의 출력 키. 설정하면 해당 키로 출력을 가져오려고 시도합니다.
ru: Ключ вывода AWEL flow. Если установлен, будет пытаться получить вывод по этому ключу
zh_cn: AWEL 工作流的输出键，若设置了该键，则会尝试通过它来获取输出
