Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_serve_file.po
Languages: fr, ja, ko, ru, zh_cn

source: File Serve Configurations
fr: Configurations du service de fichiers
ja: ファイルサービス設定
ko: 파일 서비스 구성
ru: Конфигурации файлового сервера
zh_cn: 文件服务配置

source: This configuration is for the file serve module. In DB-GPT, you can store yourfiles in the file server.
fr: Cette configuration est destinée au module de service de fichiers. Dans DB-GPT, vous pouvez stocker vos fichiers sur le serveur de fichiers.
ja: この設定はファイルサービスモジュール用です。DB-GPT では、ファイルをファイルサーバーに保存できます。
ko: 이 구성은 파일 서비스 모듈용입니다. DB-GPT에서는 파일 서버에 파일을 저장할 수 있습니다.
ru: Эта конфигурация предназначена для модуля файлового сервера. В DB-GPT вы можете хранить свои файлы на файловом сервере.
zh_cn: 此配置用于文件服务模块。在 DB-GPT 中，您可以将文件存储在文件服务器中。

source: Check the hash of the file when downloading
fr: Vérifier le hachage du fichier lors du téléchargement
ja: ファイルをダウンロードする際にファイルのハッシュ値をチェックする
ko: 파일 다운로드 시 파일의 해시값 확인
ru: Проверять хэш файла при скачивании
zh_cn: 下载文件时检查文件的哈希值

source: The host of the file server
fr: L'hôte du serveur de fichiers
ja: ファイルサーバーのホスト名
ko: 파일 서버의 호스트
ru: Хост файлового сервера
zh_cn: 文件服务器的主机名

source: The port of the file server, default is 5670
fr: Le port du serveur de fichiers, la valeur par défaut est 5670
ja: ファイルサーバーのポート番号、デフォルトは 5670
ko: 파일 서버의 포트, 기본값은 5670
ru: Порт файлового сервера, по умолчанию 5670
zh_cn: 文件服务器的端口，默认为 5670

source: The chunk size when downloading the file
fr: La taille des blocs lors du téléchargement du fichier
ja: ファイルをダウンロードする際のチャンクサイズ
ko: 파일 다운로드 시 청크 크기
ru: Размер блока при скачивании файла
zh_cn: 下载文件时的分块大小

source: The chunk size when saving the file
fr: La taille des blocs lors de la sauvegarde du fichier
ja: ファイルを保存する際のチャンクサイズ
ko: 파일 저장 시 청크 크기
ru: Размер блока при сохранении файла
zh_cn: 保存文件时的分块大小

source: The chunk size when transferring the file
fr: La taille des blocs lors du transfert du fichier
ja: ファイルを転送する際のチャンクサイズ
ko: 파일 전송 시 청크 크기
ru: Размер блока при передаче файла
zh_cn: 传输文件时的分块大小

source: The timeout when transferring the file
fr: Le délai d'attente lors du transfert du fichier
ja: ファイルを転送する際のタイムアウト時間
ko: 파일 전송 시 타임아웃
ru: Тайм-аут при передаче файла
zh_cn: 传输文件时的超时时间

source: The local storage path
fr: Le chemin de stockage local
ja: ローカルストレージパス
ko: 로컬 저장 경로
ru: Путь к локальному хранилищу
zh_cn: 本地存储路径

source: The storage backend configurations
fr: Les configurations du backend de stockage
ja: ストレージバックエンド設定
ko: 저장 백엔드 구성
ru: Конфигурации бэкенда хранения
zh_cn: 存储后端配置
