Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_serve_core.po
Languages: fr, ja, ko, ru, zh_cn

source: API keys for the endpoint, if None, allow all
fr: Clés API pour le point de terminaison. Si None, autoriser tous.
ja: エンドポイントのAPIキー。Noneの場合、すべてのリクエストを許可します。
ko: 엔드포인트용 API 키입니다. None인 경우 모든 요청을 허용합니다.
ru: API-ключи для конечной точки. Если значение равно None, разрешить все.
zh_cn: 端点的 API 密钥，若为 None，则允许所有请求

source: The number of start rounds to keep in memory
fr: Le nombre de premières rounds à conserver en mémoire
ja: メモリに保持する開始ラウンド数
ko: 메모리에 유지할 시작 라운드 수입니다.
ru: Количество начальных раундов, которые нужно сохранить в памяти
zh_cn: 内存中要保留的起始轮数

source: The number of end rounds to keep in memory
fr: Le nombre de dernières rounds à conserver en mémoire
ja: メモリに保持する終了ラウンド数
ko: 메모리에 유지할 종료 라운드 수입니다.
ru: Количество конечных раундов, которые нужно сохранить в памяти
zh_cn: 内存中要保留的结束轮数

source: The max token limit. Default is 100k
fr: La limite maximale de tokens. La valeur par défaut est 100 000.
ja: 最大トークン制限。デフォルトは100kです。
ko: 최대 토큰 제한입니다. 기본값은 100k입니다.
ru: Максимальное ограничение по токенам. По умолчанию 100 тысяч.
zh_cn: 最大 Token 限制，默认值为 100k

source: The top k for LLM generation
fr: Le top k pour la génération du LLM
ja: 大規模言語モデル生成時のTop kパラメータ
ko: LLM 생성을 위한 상위 k값입니다.
ru: Значение top k для генерации Large Language Model
zh_cn: 大语言模型生成时的 Top k 参数

source: The top p for LLM generation
fr: Le top p pour la génération du LLM
ja: 大規模言語モデル生成時のTop pパラメータ
ko: LLM 생성을 위한 상위 p값입니다.
ru: Значение top p для генерации Large Language Model
zh_cn: 大语言模型生成时的 Top p 参数

source: The temperature for LLM generation
fr: La température pour la génération du LLM
ja: 大規模言語モデル生成時の温度パラメータ
ko: LLM 생성을 위한 온도값입니다.
ru: Температура для генерации Large Language Model
zh_cn: 大语言模型生成时的温度参数

source: The max new tokens for LLM generation
fr: Le nombre maximal de nouveaux tokens pour la génération du LLM
ja: 大規模言語モデル生成時の最大新トークン数
ko: LLM 생성을 위한 최대 새 토큰 수입니다.
ru: Максимальное количество новых токенов для генерации Large Language Model
zh_cn: 大语言模型生成时的最大新 Token 数

source: The name of your app
fr: Le nom de votre application
ja: あなたのアプリの名前
ko: 귀하의 앱 이름입니다.
ru: Название вашего приложения
zh_cn: 你的应用程序名称

source: The memory configuration
fr: La configuration de la mémoire
ja: メモリ設定
ko: 메모리 구성입니다.
ru: Конфигурация памяти
zh_cn: 内存配置

source: The configs for specific app
fr: Les configurations pour une application spécifique
ja: 特定のアプリの設定
ko: 특정 앱에 대한 구성 설정
ru: Конфигурации для конкретного приложения
zh_cn: 特定应用程序的配置
