Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_ext_storage.po
Languages: fr, ja, ru

source: Graph Name
fr: Nom du graphe
ja: グラフ名
ru: Название графа

source: The name of Graph, if not set, will use the default name.
fr: Le nom du graphe, s'il n'est pas défini, utilisera le nom par défaut.
ja: グラフの名前です。設定されていない場合は、デフォルトの名前が使用されます。
ru: Название графа. Если не задано, будет использовано имя по умолчанию.

source: Embedding Function
fr: Fonction d'incorporation
ja: 埋め込み関数
ru: Функция эмбеддинга

source: The embedding function of vector store, if not set, will use the default embedding function.
fr: La fonction d'incorporation du stockage de vecteurs, si elle n'est pas définie, utilisera la fonction d'incorporation par défaut.
ja: ベクトルストアの埋め込み関数です。設定されていない場合は、デフォルトの埋め込み関数が使用されます。
ru: Функция эмбеддинга векторного хранилища. Если не задана, будет использована функция эмбеддинга по умолчанию.

source: Max Chunks Once Load
fr: Nombre maximal de blocs chargés à la fois
ja: 一度に読み込む最大チャンク数
ru: Максимальное количество чанков при одном загрузке

source: The max number of chunks to load at once. If your document is large, you can set this value to a larger number to speed up the loading process. Default is 10.
fr: Le nombre maximal de blocs à charger à la fois. Si votre document est volumineux, vous pouvez définir cette valeur sur un nombre plus élevé pour accélérer le processus de chargement. La valeur par défaut est 10.
ja: 一度に読み込む最大チャンク数です。ドキュメントが大きい場合、この値を大きくすることで読み込み速度を向上させることができます。デフォルトは10です。
ru: Максимальное количество чанков, которое можно загрузить за один раз. Если ваш документ большой, вы можете установить это значение большим, чтобы ускорить процесс загрузки. По умолчанию равно 10.

source: Max Threads
fr: Nombre maximal de threads
ja: 最大スレッド数
ru: Максимальное количество потоков

source: The max number of threads to use. Default is 1. If you set this bigger than 1, please make sure your vector store is thread-safe.
fr: Le nombre maximal de threads à utiliser. La valeur par défaut est 1. Si vous définissez cette valeur supérieure à 1, assurez-vous que votre stockage de vecteurs est sûr pour les threads.
ja: 使用する最大スレッド数です。デフォルトは1です。この値を1より大きく設定する場合は、ベクトルストアがスレッドセーフであることを確認してください。
ru: Максимальное количество потоков для использования. По умолчанию равно 1. Если вы установите это значение больше 1, убедитесь, что ваше векторное хранилище потокобезопасно.

source: Builtin Graph Config
fr: Configuration de graphe intégrée
ja: 組み込みグラフ設定
ru: Встроенная конфигурация графа

source: knowledge graph config.
fr: Configuration du graphe de connaissances.
ja: 知識グラフの設定です。
ru: Конфигурация знания графа.

source: Knowledge Graph Type
fr: Type de graphe de connaissances
ja: 知識グラフの種類
ru: Тип знания графа

source: graph store type.
fr: Type de stockage de graphe.
ja: グラフストアの種類です。
ru: Тип хранилища графа.

source: LLM Client
fr: Client LLM
ja: LLM クライアント
ru: LLM 客户端

source: llm client for extract graph triplets.
fr: Client LLM pour extraire les triplets de graphe.
ja: グラフのトリプレットを抽出するためのLLMクライアントです。
ru: LLM 客户端用于提取图三元组。

source: LLM Model Name
fr: Nom du modèle LLM
ja: LLM モデル名
ru: Название модели LLM

source: llm model name.
fr: Nom du modèle LLM.
ja: LLM モデルの名前です。
ru: Название модели LLM.

source: Builtin Knowledge Graph
fr: Graphe de connaissances intégré
ja: 組み込み知識グラフ
ru: Встроенный граф знаний

source: Builtin Knowledge Graph.
fr: Graphe de connaissances intégré.
ja: 組み込み知識グラフです。
ru: Встроенный граф знаний.

source: Builtin Knowledge Graph Config.
fr: Configuration du graphe de connaissances intégré.
ja: 組み込み知識グラフの設定です。
ru: Конфигурация встроенного графа знаний.

source: Community Summary KG Config
fr: Configuration du graphe de connaissances de synthèse communautaire
ja: コミュニティ要約KG設定
ru: Конфигурация графа знаний обобщения сообщества

source: community Summary kg Config.
fr: Configuration du graphe de connaissances de synthèse communautaire.
ja: コミュニティ要約KGの設定です。
ru: Конфигурация графа знаний обобщения сообщества.

source: Vector Store Type
fr: Type de stockage vectoriel
ja: ベクトルストアの種類
ru: Тип векторного хранилища

source: vector store type.
fr: Type de stockage vectoriel.
ja: ベクトルストアの種類です。
ru: Тип векторного хранилища.

source: Topk of Knowledge Graph Extract
fr: Topk de l'extraction du graphe de connaissances
ja: 知識グラフ抽出のトップK
ru: Топ-K извлечения знаний из графа.

source: Topk of knowledge graph extract
fr: Topk de l'extraction du graphe de connaissances
ja: 知識グラフ抽出のトップK
ru: Топ-K извлечения знаний из графа.

source: Recall Score of Knowledge Graph Extract
fr: Score de rappel de l'extraction du graphe de connaissances
ja: 知識グラフ抽出の再現率スコア
ru: Показатель полноты извлечения знаний из графа.

source: Recall score of knowledge graph extract
fr: Score de rappel de l'extraction du graphe de connaissances
ja: 知識グラフ抽出の再現率スコア
ru: Показатель полноты извлечения знаний из графа.

source: Recall Score of Community Search in Knowledge Graph
fr: Score de rappel de la recherche communautaire dans le graphe de connaissances
ja: 知識グラフ内のコミュニティ検索の再現率スコア
ru: Показатель полноты поиска сообщества в графе знаний.

source: Recall score of community search in knowledge graph
fr: Score de rappel de la recherche communautaire dans le graphe de connaissances
ja: 知識グラフ内のコミュニティ検索の再現率スコア
ru: Показатель полноты поиска сообщества в графе знаний.

source: Enable the graph search for documents and chunks
fr: Activer la recherche de graphe pour les documents et les segments
ja: ドキュメントとチャンクのグラフ検索を有効にする
ru: Включить поиск в графе для документов и фрагментов.

source: Enable the graph search for triplets
fr: Activer la recherche de graphe pour les triplets
ja: トリプレットのグラフ検索を有効にする
ru: Включить поиск в графе для троек.

source: Top size of knowledge graph chunk search
fr: Taille maximale de la recherche de segments dans le graphe de connaissances
ja: 知識グラフチャンク検索の上位件数
ru: Максимальный размер поиска фрагментов в графе знаний.

source: Batch size of triplets extraction from the text
fr: Taille du lot pour l'extraction de triplets à partir du texte
ja: テキストからのトリプレット抽出のバッチサイズ
ru: Размер пакета для извлечения триплетов из текста

source: Batch size of parallel community building process
fr: Taille du lot pour le processus de construction parallèle de communautés
ja: 並列コミュニティ構築プロセスのバッチサイズ
ru: Размер пакета для параллельного процесса построения сообщества

source: TBatch size of parallel community building process
fr: Taille du lot pour le processus de construction parallèle de communautés
ja: 並列コミュニティ構築プロセスのバッチサイズ
ru: Размер пакета для параллельного процесса построения сообщества

source: Community Summary Knowledge Graph
fr: Graphe de connaissances de synthèse de communauté
ja: コミュニティ要約知識グラフ
ru: Граф знаний по сводке сообщества

source: Community Summary Knowledge Graph.
fr: Graphe de connaissances de synthèse de communauté.
ja: コミュニティ要約知識グラフ。
ru: Граф знаний по сводке сообщества.

source: Community Summary Knowledge Graph Config.
fr: Configuration du graphe de connaissances de synthèse de communauté.
ja: コミュニティ要約知識グラフ設定。
ru: Конфигурация графа знаний по сводке сообщества.

source: PGVector Config
fr: Configuration PGVector
ja: PGVector 設定
ru: Конфигурация PGVector

source: Connection String
fr: Chaîne de connexion
ja: 接続文字列
ru: Строка подключения

source: The connection string of vector store, if not set, will use the default connection string.
fr: La chaîne de connexion du magasin de vecteurs, si elle n'est pas définie, utilisera la chaîne de connexion par défaut.
ja: ベクトルストアの接続文字列。設定されていない場合は、デフォルトの接続文字列が使用されます。
ru: Строка подключения векторного хранилища. Если не задана, будет использоваться строка подключения по умолчанию.

source: PG Vector Store
fr: Magasin de vecteurs PG
ja: PG ベクトルストア
ru: PG Векторное хранилище

source: PG vector store.
fr: Magasin de vecteurs PG.
ja: PG ベクトルストア。
ru: PG Векторное хранилище.

source: PG Config
fr: Configuration PG
ja: PG 設定
ru: Конфигурация PG

source: the pg config of vector store.
fr: La configuration PG du magasin de vecteurs.
ja: ベクトルストアの PG 設定。
ru: Конфигурация PG для векторного хранилища.

source: Weaviate Config
fr: Configuration Weaviate
ja: Weaviate 設定
ru: Конфигурация Weaviate

source: Weaviate vector config.
fr: Configuration vectorielle Weaviate.
ja: Weaviate ベクトル設定。
ru: Конфигурация векторов Weaviate.

source: Weaviate URL
fr: URL Weaviate
ru: URL-адрес Weaviate

source: weaviate url address, if not set, will use the default url.
fr: Adresse URL Weaviate. Si elle n'est pas définie, l'URL par défaut sera utilisée.
ja: WeaviateのURLアドレス。設定されていない場合は、デフォルトのURLが使用されます。
ru: URL-адрес Weaviate. Если не задан, будет использован URL по умолчанию.

source: Persist Path
fr: Chemin de persistance
ja: 永続化パス
ru: Путь для сохранения

source: the persist path of vector store.
fr: Le chemin de persistance du magasin de vecteurs.
ja: ベクトルストアの永続化パス。
ru: Путь для сохранения векторного хранилища.

source: Weaviate Vector Store
fr: Magasin de vecteurs Weaviate
ja: Weaviate ベクトルストア
ru: Векторное хранилище Weaviate

source: Weaviate vector store.
fr: Magasin de vecteurs Weaviate.
ja: Weaviate ベクトルストア。
ru: Векторное хранилище Weaviate.

source: the weaviate config of vector store.
fr: La configuration Weaviate du magasin de vecteurs.
ja: ベクトルストアのWeaviate設定。
ru: Конфигурация Weaviate для векторного хранилища.

source: Elastic Vector Config
fr: Configuration vectorielle Elastic
ja: Elastic ベクトル設定
ru: Конфигурация векторов Elastic

source: The uri of elasticsearch store, if not set, will use the default uri.
fr: L'URI du magasin Elasticsearch. Si elle n'est pas définie, l'URI par défaut sera utilisée.
ja: ElasticsearchストアのURIです。設定されていない場合は、デフォルトのURIが使用されます。
ru: URI хранилища Elasticsearch. Если не задан, будет использован URI по умолчанию.

source: Port
ja: ポート
ru: Порт

source: The port of elasticsearch store, if not set, will use the default port.
fr: Le port du magasin Elasticsearch. Si celui-ci n'est pas défini, le port par défaut sera utilisé.
ja: Elasticsearchストアのポートです。設定されていない場合は、デフォルトのポートが使用されます。
ru: Порт хранилища Elasticsearch. Если не задан, будет использован порт по умолчанию.

source: Alias
ja: エイリアス
ru: Алиас

source: The alias of elasticsearch store, if not set, will use the default alias.
fr: L'alias du magasin Elasticsearch, s'il n'est pas défini, utilisera l'alias par défaut.
ja: Elasticsearchストアのエイリアスです。設定されていない場合は、デフォルトのエイリアスが使用されます。
ru: Алиас хранилища Elasticsearch. Если не задан, будет использован алиас по умолчанию.

source: Index Name
fr: Nom de l'index
ja: インデックス名
ru: Имя индекса

source: The index name of elasticsearch store, if not set, will use the default index name.
fr: Le nom de l'index du magasin Elasticsearch, s'il n'est pas défini, utilisera le nom d'index par défaut.
ja: Elasticsearch ストアのインデックス名です。設定されていない場合、デフォルトのインデックス名が使用されます。
ru: Имя индекса хранилища Elasticsearch. Если не задано, будет использовано имя индекса по умолчанию.

source: Elasticsearch vector config.
fr: Configuration vectorielle d'Elasticsearch.
ja: Elasticsearch ベクトル設定。
ru: Конфигурация векторов Elasticsearch.

source: Elastic Vector Store
fr: Magasin vectoriel Elastic
ja: Elastic ベクトルストア
ru: Elastic Векторное хранилище

source: Elastic vector store.
fr: Magasin vectoriel Elastic.
ja: Elastic ベクトルストア。
ru: Elastic векторное хранилище.

source: Elastic Config
fr: Configuration Elastic
ja: Elastic 設定
ru: Конфигурация Elastic

source: the elastic config of vector store.
fr: La configuration Elastic du magasin vectoriel.
ja: ベクトルストアの Elastic 設定。
ru: Конфигурация Elastic для векторного хранилища.

source: Milvus Config
fr: Configuration Milvus
ja: Milvus 設定
ru: Конфигурация Milvus

source: The uri of milvus store, if not set, will use the default uri.
fr: L'URI du magasin Milvus. Si elle n'est pas définie, l'URI par défaut sera utilisée.
ja: Milvus ストアの URI です。設定されていない場合、デフォルトの URI が使用されます。
ru: URI хранилища Milvus. Если не задано, будет использоваться значение по умолчанию.

source: The port of milvus store, if not set, will use the default port.
fr: Le port du magasin Milvus. Si il n'est pas défini, le port par défaut sera utilisé.
ja: Milvus ストアのポート。設定されていない場合は、デフォルトのポートが使用されます。
ru: Порт хранилища Milvus. Если не задано, будет использоваться порт по умолчанию.

source: The alias of milvus store, if not set, will use the default alias.
fr: L'alias du magasin Milvus. Si il n'est pas défini, l'alias par défaut sera utilisé.
ja: Milvus ストアのエイリアス。設定されていない場合は、デフォルトのエイリアスが使用されます。
ru: Псевдоним хранилища Milvus. Если не задано, будет использоваться псевдоним по умолчанию.

source: Primary Field
fr: Champ primaire
ja: 主フィールド
ru: Основное поле

source: The primary field of milvus store, if not set, will use the default primary field.
fr: Le champ primaire du magasin Milvus. Si il n'est pas défini, le champ primaire par défaut sera utilisé.
ja: Milvus ストアの主フィールド。設定されていない場合は、デフォルトの主フィールドが使用されます。
ru: Основное поле хранилища Milvus. Если не задано, будет использоваться основное поле по умолчанию.

source: Text Field
fr: Champ texte
ja: テキストフィールド
ru: Текстовое поле

source: The text field of milvus store, if not set, will use the default text field.
fr: Le champ texte du magasin Milvus. Si il n'est pas défini, le champ texte par défaut sera utilisé.
ja: Milvus ストアのテキストフィールド。設定されていない場合は、デフォルトのテキストフィールドが使用されます。
ru: Текстовое поле хранилища Milvus. Если не задано, будет использоваться текстовое поле по умолчанию.

source: Embedding Field
fr: Champ d'incorporation
ja: 埋め込みフィールド
ru: Поле эмбеддинга

source: The embedding field of milvus store, if not set, will use the default embedding field.
fr: Le champ d'incorporation du magasin Milvus. Si il n'est pas défini, le champ d'incorporation par défaut sera utilisé.
ja: Milvus ストアの埋め込みフィールド。設定されていない場合は、デフォルトの埋め込みフィールドが使用されます。
ru: Поле эмбеддинга хранилища Milvus. Если не задано, будет использоваться поле эмбеддинга по умолчанию.

source: Milvus vector config.
fr: Configuration du vecteur Milvus.
ja: Milvus ベクトル設定。
ru: Конфигурация векторов Milvus.

source: Milvus Vector Store
fr: Magasin de vecteurs Milvus
ja: Milvus ベクトルストア
ru: Векторное хранилище Milvus

source: Milvus vector store.
fr: Magasin de vecteurs Milvus.
ja: Milvus ベクトルストア。
ru: Векторное хранилище Milvus.

source: the milvus config of vector store.
fr: La configuration Milvus du stockage de vecteurs.
ja: ベクトルストアのMilvus 設定。
ru: Конфигурация Milvus для векторного хранилища.

source: Chroma Config
fr: Configuration Chroma
ja: Chroma設定
ru: Конфигурация Chroma

source: Chroma vector store config.
fr: Configuration du stockage de vecteurs Chroma.
ja: Chromaベクトルストア設定。
ru: Конфигурация векторного хранилища Chroma.

source: The metadata of collection.
fr: Les métadonnées de la collection.
ja: コレクションのメタデータ。
ru: Метаданные коллекции.

source: Chroma Vector Store
fr: Stockage de vecteurs Chroma
ja: Chromaベクトルストア
ru: Векторное хранилище Chroma

source: Chroma vector store.
fr: Stockage de vecteurs Chroma.
ja: Chromaベクトルストア。
ru: Векторное хранилище Chroma.

source: the chroma config of vector store.
fr: La configuration Chroma du stockage de vecteurs.
ja: ベクトルストアのChroma設定。
ru: Конфигурация Chroma для векторного хранилища.

source: OceanBase Config
fr: Configuration OceanBase
ja: OceanBase設定
ru: Конфигурация OceanBase

source: OceanBase Host
fr: Hôte OceanBase
ja: OceanBaseホスト
ru: Хост OceanBase

source: oceanbase host
fr: Hôte OceanBase
ja: OceanBaseホスト
ru: Хост OceanBase

source: OceanBase Port
fr: Port OceanBase
ja: OceanBaseポート
ru: Порт OceanBase

source: oceanbase port
fr: Port OceanBase
ja: OceanBaseポート
ru: Порт OceanBase

source: OceanBase User
fr: Utilisateur OceanBase
ja: OceanBaseユーザー
ru: Пользователь OceanBase

source: user to login
fr: Utilisateur pour la connexion
ja: ログインするユーザー
ru: Пользователь для входа

source: OceanBase Password
fr: Mot de passe OceanBase
ja: OceanBaseパスワード
ru: Пароль OceanBase

source: password to login
fr: Mot de passe pour se connecter
ja: ログイン用パスワード
ru: Пароль для входа

source: OceanBase Database
fr: Base de données OceanBase
ja: OceanBase データベース
ru: База данных OceanBase

source: database for vector tables
fr: Base de données pour les tables de vecteurs
ja: ベクトルテーブル用のデータベース
ru: База данных для векторных таблиц

source: OceanBase Vector Store
fr: Stockage de vecteurs OceanBase
ja: OceanBase ベクトルストア
ru: Хранилище векторов OceanBase

source: OceanBase vector store.
fr: Stockage de vecteurs OceanBase.
ja: OceanBase ベクトルストア。
ru: Хранилище векторов OceanBase.

source: the ob config of vector store.
fr: La configuration OB du stockage de vecteurs.
ja: ベクトルストアの OceanBase 設定。
ru: Конфигурация OB хранилища векторов.

source: The endpoint of the s3 server. e.g. https://s3.us-east-1.amazonaws.com
fr: Le point de terminaison du serveur S3. Par exemple : https://s3.us-east-1.amazonaws.com
ja: S3サーバーのエンドポイント。例: https://s3.us-east-1.amazonaws.com
ru: Конечная точка сервера S3. Например, https://s3.us-east-1.amazonaws.com

source: The region of the s3 server. e.g. us-east-1
fr: La région du serveur S3. Par exemple : us-east-1
ja: S3サーバーのリージョン。例: us-east-1
ru: Регион сервера S3. Например, us-east-1

source: The access key ID of the s3 server. You can also set it in the environment variable AWS_ACCESS_KEY_ID
fr: L'identifiant de la clé d'accès du serveur S3. Vous pouvez également le définir dans la variable d'environnement AWS_ACCESS_KEY_ID
ja: S3サーバーのアクセスキーIDです。環境変数 AWS_ACCESS_KEY_ID にこれを設定することもできます。
ru: Идентификатор ключа доступа к серверу S3. Вы также можете установить его в переменной окружения AWS_ACCESS_KEY_ID

source: The access key secret of the s3 server. You can also set it in the environment variable AWS_SECRET_ACCESS_KEY
fr: Le secret de la clé d'accès du serveur S3. Vous pouvez également le définir dans la variable d'environnement AWS_SECRET_ACCESS_KEY
ja: S3サーバーのアクセスキーシークレットです。環境変数 AWS_SECRET_ACCESS_KEY にこれを設定することもできます。
ru: Секретный ключ доступа к серверу S3. Вы также можете установить его в переменной окружения AWS_SECRET_ACCESS_KEY

source: Whether to use the environment variables AWS_ACCESS_KEY_ID and AWS_SECRET_ACCESS_KEY as the credentials. Default is False.
fr: Utiliser les variables d'environnement AWS_ACCESS_KEY_ID et AWS_SECRET_ACCESS_KEY comme identifiants. La valeur par défaut est False.
ja: 環境変数 AWS_ACCESS_KEY_ID と AWS_SECRET_ACCESS_KEY を認証情報として使用するかどうかを指定します。デフォルトは False です。
ru: Использовать ли переменные окружения AWS_ACCESS_KEY_ID и AWS_SECRET_ACCESS_KEY в качестве учетных данных. По умолчанию — нет.

source: The fixed bucket name to use. If set, all logical buckets in DB-GPT will be mapped to this bucket. We suggest you set this value to avoid bucket name conflicts.
fr: Le nom fixe du compartiment à utiliser. Si défini, tous les compartiments logiques dans DB-GPT seront mappés à ce compartiment. Nous vous suggérons de définir cette valeur pour éviter les conflicts de noms de compartiments.
ja: 使用する固定バケット名です。設定すると、DB-GPT内のすべての論理バケットがこのバケットにマッピングされます。バケット名の衝突を避けるためにこの値を設定することをおすすめします。
ru: Используемое фиксированное имя бакета. Если задано, все логические бакеты в DB-GPT будут сопоставлены с этим бакетом. Мы рекомендуем установить это значение, чтобы избежать конфликтов имен бакетов.

source: The prefix of the bucket name. If set, all logical buckets in DB-GPT will be prefixed with this value. Just work when fixed_bucket is None.
fr: Le préfixe du nom du compartiment. Si défini, tous les compartiments logiques dans DB-GPT auront ce préfixe. Cela ne fonctionne que lorsque fixed_bucket est None.
ja: バケット名の接頭辞です。設定すると、DB-GPT内のすべての論理バケットにこの値が接頭辞として付けられます。fixed_bucket が None の場合のみ有効です。
ru: Префикс имени бакета. Если задан, все логические бакеты в DB-GPT будут иметь этот префикс. Действует только когда fixed_bucket не задан.

source: Whether to create the bucket automatically if it does not exist. If set to False, the bucket must exist before using it.
fr: Créer automatiquement le compartiment s'il n'existe pas. Si défini sur False, le compartiment doit exister avant de l'utiliser.
ja: バケットが存在しない場合に自動的に作成するかどうかを指定します。Falseに設定すると、使用する前にバケットが存在している必要があります。
ru: Создавать ли бакет автоматически, если он не существует. Если установлено значение False, бакет должен существовать перед использованием.

source: The chunk size when saving the file. When the file is larger 10x than this value, it will be uploaded in multiple parts. Default is 1M.
fr: La taille des morceaux lors de la sauvegarde du fichier. Lorsque le fichier est 10 fois plus grand que cette valeur, il sera téléchargé en plusieurs parties. La valeur par défaut est 1M.
ja: ファイル保存時のチャンクサイズを指定します。ファイルサイズがこの値の10倍を超える場合、複数のパートに分けてアップロードされます。デフォルトは 1M です。
ru: Размер части при сохранении файла. Когда размер файла превышает это значение в 10 раз, он будет загружен по частям. По умолчанию — 1 МБ.

source: The signature version of the s3 server. e.g. s3v4, s3v2, None (default)
fr: La version de signature du serveur S3. Par exemple, s3v4, s3v2, None (par défaut)
ja: S3サーバーの署名バージョンを指定します。例: s3v4, s3v2, None (デフォルト)
ru: Версия подписи сервера S3. Например, s3v4, s3v2, None (по умолчанию)

source: The additional configuration for the S3 client.
fr: La configuration supplémentaire pour le client S3.
ja: S3クライアント用の追加設定を指定します。
ru: Дополнительная конфигурация для клиента S3.

source: The endpoint of the OSS server. e.g. https://oss-cn-hangzhou.aliyuncs.com
fr: Le point de terminaison du serveur OSS. Par exemple : https://oss-cn-hangzhou.aliyuncs.com
ja: OSSサーバーのエンドポイントを指定します。例: https://oss-cn-hangzhou.aliyuncs.com
ru: Конечная точка сервера OSS. Например, https://oss-cn-hangzhou.aliyuncs.com

source: The region of the OSS server. e.g. cn-hangzhou
fr: La région du serveur OSS. Par exemple : cn-hangzhou
ja: OSSサーバーのリージョンを指定します。例: cn-hangzhou
ru: Регион сервера OSS. Например, cn-hangzhou

source: The access key ID of the OSS server. You can also set it in the environment variable OSS_ACCESS_KEY_ID
fr: L'identifiant de la clé d'accès du serveur OSS. Vous pouvez également le définir dans la variable d'environnement OSS_ACCESS_KEY_ID
ja: OSSサーバーのアクセスキーIDです。環境変数 OSS_ACCESS_KEY_ID に設定することもできます。
ru: Идентификатор ключа доступа к серверу OSS. Вы также можете установить его в переменной окружения OSS_ACCESS_KEY_ID

source: The access key secret of the OSS server. You can also set it in the environment variable OSS_ACCESS_KEY_SECRET
fr: Le secret de la clé d'accès du serveur OSS. Vous pouvez également le définir dans la variable d'environnement OSS_ACCESS_KEY_SECRET
ja: OSSサーバーのアクセスキーシークレットです。環境変数 OSS_ACCESS_KEY_SECRET に設定することもできます。
ru: Секретный ключ доступа к серверу OSS. Вы также можете установить его в переменной окружения OSS_ACCESS_KEY_SECRET

source: Whether to use the environment variables OSS_ACCESS_KEY_ID and OSS_ACCESS_KEY_SECRET as the credentials. Default is False.
fr: Si vous souhaitez utiliser les variables d'environnement OSS_ACCESS_KEY_ID et OSS_ACCESS_KEY_SECRET comme informations d'identification. La valeur par défaut est False.
ja: 環境変数 OSS_ACCESS_KEY_ID と OSS_ACCESS_KEY_SECRET を認証情報として使用するかどうかを指定します。デフォルトは False です。
ru: Использовать ли переменные окружения OSS_ACCESS_KEY_ID и OSS_ACCESS_KEY_SECRET в качестве учетных данных. По умолчанию — False.
