Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_datasource.po
Languages: fr, ja, ko, ru, zh_cn

source: Database host, e.g., localhost
fr: Hôte de la base de données, par exemple, localhost
ja: データベースホスト、例: localhost
ko: 데이터베이스 호스트, 예: localhost
ru: Адрес сервера базы данных, например, localhost
zh_cn: 数据库主机，例如：localhost

source: Database port, e.g., 3306
fr: Port de la base de données, par exemple, 3306
ja: データベースポート、例: 3306
ko: 데이터베이스 포트, 예: 3306
ru: Порт базы данных, например, 3306
zh_cn: 数据库端口，例如：3306

source: Database user to connect
fr: Utilisateur de la base de données pour la connexion
ja: 接続に使用するデータベースユーザー
ko: 연결할 데이터베이스 사용자
ru: Пользователь базы данных для подключения
zh_cn: 用于连接数据库的用户

source: Database name
fr: Nom de la base de données
ja: データベース名
ko: 데이터베이스 이름
ru: Имя базы данных
zh_cn: 数据库名称

source: Database driver, e.g., mysql+pymysql
fr: Pilote de la base de données, par exemple, mysql+pymysql
ja: データベースドライバー、例: mysql+pymysql
ko: 데이터베이스 드라이버, 예: mysql+pymysql
ru: Драйвер базы данных, например, mysql+pymysql
zh_cn: 数据库驱动程序，例如：mysql+pymysql

source: Database password, you can write your password directly, of course, you can also use environment variables, such as ${env:DBGPT_DB_PASSWORD}
fr: Mot de passe de la base de données, vous pouvez écrire votre mot de passe directement, bien sûr, vous pouvez également utiliser des variables d'environnement, comme ${env:DBGPT_DB_PASSWORD}
ja: データベースパスワードです。パスワードを直接入力することもできますし、環境変数を使用することもできます。例: ${env:DBGPT_DB_PASSWORD}
ko: 데이터베이스 비밀번호입니다. 직접 비밀번호를 입력할 수도 있고, 환경 변수(예: ${env:DBGPT_DB_PASSWORD})를 사용할 수도 있습니다.
ru: Пароль от базы данных. Вы можете ввести его напрямую, а также использовать переменные окружения, например, ${env:DBGPT_DB_PASSWORD}
zh_cn: 数据库密码，你可以直接写入密码，当然也可以使用环境变量，例如：${env:DBGPT_DB_PASSWORD}

source: Connection pool size, default 5
fr: Taille du pool de connexions, par défaut 5
ja: 接続プールのサイズ、デフォルトは 5
ko: 연결 풀 크기, 기본값 5
ru: Размер пула соединений, по умолчанию 5
zh_cn: 连接池大小，默认为 5

source: Max overflow connections, default 10
fr: Nombre maximum de connexions débordantes, par défaut 10
ja: 最大オーバーフロー接続数、デフォルトは 10
ko: 최대 오버플로우 연결 수, 기본값 10
ru: Максимальное количество дополнительных соединений, по умолчанию 10
zh_cn: 最大溢出连接数，默认为 10

source: Connection pool timeout, default 30
fr: Délai d'attente du pool de connexions, par défaut 30
ja: 接続プールのタイムアウト時間、デフォルトは 30 秒
ko: 연결 풀 제한 시간, 기본값 30
ru: Тайм-аут пула соединений, по умолчанию 30
zh_cn: 连接池超时时间，默认为 30 秒

source: Connection pool recycle, default 3600
fr: Recyclage du pool de connexions, par défaut 3600
ja: 接続プールのリサイクル時間、デフォルトは 3600 秒
ko: 연결 풀 재사용 주기, 기본값 3600
ru: Период обновления соединений в пуле, по умолчанию 3600
zh_cn: 连接池回收时间，默认为 3600 秒

source: Connection pool pre ping, default True
fr: Pré-ping du pool de connexions, par défaut True
ja: コネクションプールの事前ピング、デフォルトは True
ko: 연결 풀 사전 핑, 기본값 True
ru: Предварительная проверка соединения в пуле, по умолчанию True
zh_cn: 连接池预连接，默认为 True
