Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_serve_rag.po
Languages: fr, ja, ru

source: Knowledge Space Operator
fr: Opérateur d'espace de connaissances
ja: 知識空間オペレーター
ru: Оператор пространства знаний

source: knowledge space retriever operator.
fr: Opérateur de récupération d'espace de connaissances.
ja: 知識空間検索オペレーター。
ru: Оператор извлечения из пространства знаний.

source: Query
fr: Requête
ja: クエリ
ru: Запрос

source: user query
fr: Requête utilisateur
ja: ユーザークエリ
ru: Запрос пользователя

source: related chunk content
fr: Contenu de bloc associé
ja: 関連するチャンク内容
ru: Связанное содержимое фрагмента

source: Space Name
fr: Nom de l'espace
ja: 空間名
ru: Название пространства

source: space name.
fr: Nom de l'espace.
ja: 空間名。
ru: Название пространства.

source: Knowledge Space Prompt Builder Operator
fr: Opérateur de construction d'invite d'espace de connaissances
ja: 知識空間プロンプトビルダーオペレーター
ru: Оператор построения промптов для пространства знаний

source: Build messages from prompt template and chat history.
fr: Construire des messages à partir d'un modèle d'invite et de l'historique de chat.
ja: プロンプトテンプレートとチャット履歴からメッセージを構築します。
ru: Создавать сообщения на основе шаблона промпта и истории чата.

source: Chat Prompt Template
fr: Modèle d'invite de chat
ja: チャットプロンプトテンプレート
ru: Шаблон чат-промпта

source: The chat prompt template.
fr: Le modèle d'invite de chat.
ja: チャットプロンプトテンプレート。
ru: Шаблон чат-промпта.

source: History Key
fr: Clé de l'historique
ja: 履歴キー
ru: Ключ истории

source: The key of history in prompt dict.
fr: La clé de l'historique dans le dictionnaire d'invite.
ja: プロンプト辞書内の履歴のキー。
ru: Ключ истории в словаре промпта.

source: String History
fr: Historique sous forme de chaîne
ja: 文字列履歴
ru: Строковая история

source: Whether to convert the history to string.
fr: Si l'historique doit être converti en chaîne de caractères.
ja: 履歴を文字列に変換するかどうか。
ru: Преобразовывать ли историю в строку?

source: user input
fr: Entrée de l'utilisateur
ja: ユーザー入力
ru: ввод пользователя

source: space related context
fr: Contexte lié à l'espace
ja: 空間関連のコンテキスト
ru: контекст, связанный с пространством

source: context of knowledge space.
fr: Contexte de l'espace de connaissances.
ja: 知識空間のコンテキスト。
ru: контекст пространства знаний.

source: History
fr: Historique
ja: 履歴
ru: История

source: The history.
fr: L'historique.
ja: 履歴。
ru: История.

source: Formatted Messages
fr: Messages formatés
ja: 整形済みメッセージ
ru: Отформатированные сообщения

source: The formatted messages.
fr: Les messages formatés.
ja: 整形済みメッセージ。
ru: Отформатированные сообщения.

source: RAG Serve Configurations
fr: Configurations du service RAG
ja: RAG サーブ設定
ru: Конфигурации сервиса RAG

source: This configuration is for the RAG serve module.
fr: Cette configuration est destinée au module de service RAG.
ja: この設定はRAGサーブモジュール用です。
ru: Эта конфигурация предназначена для модуля сервиса RAG.

source: Embedding Model
fr: Modèle d'encastrement
ja: 埋め込みモデル
ru: Модель эмбеддинга

source: Whether to verify the SSL certificate of the database
fr: Vérifier ou non le certificat SSL de la base de données
ja: データベースのSSL証明書を検証するかどうか
ru: Проверять ли SSL-сертификат базы данных

source: The default thread pool size, If None, use default config of python thread pool
fr: Taille par défaut du pool de threads. Si None, utilisez la configuration par défaut du pool de threads Python.
ja: デフォルトのスレッドプールサイズ。Noneの場合、Pythonスレッドプールのデフォルト設定を使用します。
ru: Размер пула потоков по умолчанию. Если None, используется конфигурация пула потоков Python по умолчанию.

source: knowledge search top k
fr: Recherche de connaissances des k premiers résultats
ja: 知識検索の上位k件
ru: Топ-k результатов поиска в пространстве знаний

source: knowledge search top similarity score
fr: Score de similarité maximal dans la recherche de connaissances
ja: 知識検索の上位類似度スコア
ru: Максимальный балл сходства при поиске в пространстве знаний

source: knowledge search rewrite
fr: Reécriture de la recherche de connaissances
ja: 知識検索の再構築
ru: Перезапись поиска знаний

source: knowledge max chunks once load
fr: Nombre maximal de blocs de connaissances chargés en une seule fois
ja: 知識の一度に読み込む最大チャンク数
ru: Максимальное количество блоков знаний при одном загрузке

source: knowledge max load thread
fr: Nombre maximal de threads de chargement de connaissances
ja: 知識の最大読み込みスレッド数
ru: Максимальное количество потоков загрузки знаний

source: knowledge rerank top k
fr: Reclassement des k premiers résultats de la recherche de connaissances
ja: 知識の再ランキング上位 k 件
ru: Топ-K переранжирования знаний
