Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_ext_datasource.po
Languages: fr, ja, ru

source: Apache Spark datasource
fr: Source de données Apache Spark
ja: Apache Spark データソース
ru: Источник данных Apache Spark

source: Unified engine for large-scale data analytics.
fr: Moteur unifié pour l'analyse de données à grande échelle.
ja: 大規模データ分析のための統合エンジンです。
ru: Единый движок для крупномасштабного анализа данных.

source: The file path of the data source.
fr: Le chemin du fichier de la source de données.
ja: データソースのファイルパスです。
ru: Путь к файлу источника данных.

source: TuGraph datasource
fr: Source de données TuGraph
ja: TuGraph データソース
ru: Источник данных TuGraph

source: TuGraph is a high-performance graph database jointly developed by Ant Group and Tsinghua University.
fr: TuGraph est une base de données graphique haute performance développée conjointement par le Groupe Ant et l'Université Tsinghua.
ja: TuGraphは、アントグループと清華大学が共同開発した高性能グラフデータベースです。
ru: TuGraph - это высокопроизводительная графовая база данных, совместно разработанная Ant Group и Тсинхуа университетом.

source: TuGraph server host
fr: Hôte du serveur TuGraph
ja: TuGraph サーバーホスト
ru: Хост сервера TuGraph

source: TuGraph server user
fr: Utilisateur du serveur TuGraph
ja: TuGraph サーバーユーザー
ru: Пользователь сервера TuGraph

source: Database password, you can write your password directly, of course, you can also use environment variables, such as ${env:DBGPT_DB_PASSWORD}
fr: Mot de passe de la base de données. Vous pouvez écrire votre mot de passe directement. Bien sûr, vous pouvez également utiliser des variables d'environnement, comme ${env:DBGPT_DB_PASSWORD}.
ja: データベースのパスワードを直接入力できます。もちろん、環境変数（例：${env:DBGPT_DB_PASSWORD}）を使用することも可能です。
ru: Пароль от базы данных. Вы можете ввести пароль напрямую, а также использовать переменные окружения, например ${env:DBGPT_DB_PASSWORD}

source: TuGraph server port, default 7687
fr: Port du serveur TuGraph, par défaut 7687
ja: TuGraph サーバーのポート番号（デフォルト 7687）
ru: Порт сервера TuGraph, по умолчанию 7687

source: Database name, default 'default'
fr: Nom de la base de données, par défaut 'default'
ja: データベース名（デフォルト 'default'）
ru: Имя базы данных, по умолчанию 'default'

source: Apache Hive datasource
fr: Source de données Apache Hive
ja: Apache Hive データソース
ru: Источник данных Apache Hive

source: A distributed fault-tolerant data warehouse system.
fr: Un système de entrepôt de données distribué et tolérant aux pannes.
ja: 分散型かつ障害に強いデータウェアハウスシステムです。
ru: Распределенная отказоустойчивая система хранения данных.

source: Hive server host
fr: Hôte du serveur Hive
ja: Hive サーバーホスト
ru: Хост сервера Hive

source: Hive server port, default 10000
fr: Port du serveur Hive, par défaut 10000
ja: Hive サーバーのポート番号（デフォルト 10000）
ru: Порт сервера Hive, по умолчанию 10000

source: Authentication mode: NONE, NOSASL, LDAP, KERBEROS, CUSTOM
fr: Mode d'authentification : NONE, NOSASL, LDAP, KERBEROS, CUSTOM
ja: 認証モード: NONE, NOSASL, LDAP, KERBEROS, CUSTOM
ru: Режим аутентификации: NONE, NOSASL, LDAP, KERBEROS, CUSTOM

source: Username for authentication
fr: Nom d'utilisateur pour l'authentification
ja: 認証用のユーザー名
ru: Имя пользователя для аутентификации

source: Password for LDAP or CUSTOM auth
fr: Mot de passe pour l'authentification LDAP ou CUSTOM
ja: LDAP または CUSTOM 認証用のパスワード
ru: Пароль для аутентификации LDAP или CUSTOM

source: Kerberos service name
fr: Nom du service Kerberos
ja: Kerberos サービス名
ru: Имя сервиса Kerberos

source: Transport mode: binary or http
fr: Mode de transport : binaire ou http
ja: トランスポートモード: binary または http
ru: Режим передачи: binary или http

source: Driver name for Hive, default is hive.
fr: Nom du pilote pour Hive, par défaut c'est hive.
ja: Hive 用のドライバー名、デフォルトは hive。
ru: Имя драйвера для Hive, по умолчанию hive.

source: StarRocks datasource
fr: Source de données StarRocks
ja: StarRocks データソース
ru: Источник данных StarRocks

source: An Open-Source, High-Performance Analytical Database.
fr: Une base de données analytique open source et haute performance.
ja: オープンソースの高性能分析データベース。
ru: Открытая аналитическая база данных с высокой производительностью.

source: Driver name for starrocks, default is starrocks.
fr: Nom du pilote pour StarRocks, par défaut c'est starrocks.
ja: StarRocks 用のドライバー名、デフォルトは starrocks。
ru: Имя драйвера для StarRocks, по умолчанию starrocks.

source: MySQL datasource
fr: Source de données MySQL
ja: MySQL データソース
ru: MySQL-источник данных

source: Fast, reliable, scalable open-source relational database management system.
fr: Système de gestion de base de données relationnelles open-source rapide, fiable et évolutif.
ja: 高速で信頼性が高く、拡張性のあるオープンソースのリレーショナルデータベース管理システム。
ru: Быстрая, надежная, масштабируемая система управления реляционными базами данных с открытым исходным кодом.

source: Driver name for MySQL, default is mysql+pymysql.
fr: Nom du pilote pour MySQL, la valeur par défaut est mysql+pymysql.
ja: MySQL用のドライバ名。デフォルトはmysql+pymysqlです。
ru: Имя драйвера для MySQL, по умолчанию mysql+pymysql.

source: SQLite datasource
fr: Source de données SQLite
ja: SQLite データソース
ru: SQLite-источник данных

source: Lightweight embedded relational database with simplicity and portability.
fr: Base de données relationnelle embarquée légère, simple et portable.
ja: シンプルで移植性が高い軽量の組み込み型リレーショナルデータベース。
ru: Легковесная встраиваемая реляционная база данных, простая в использовании и переносимая.

source: SQLite database file path. Use ':memory:' for in-memory database
fr: Chemin du fichier de base de données SQLite. Utilisez ':memory:' pour une base de données en mémoire.
ja: SQLiteデータベースファイルのパス。メモリ上のデータベースには ':memory:' を使用します。
ru: Путь к файлу базы данных SQLite. Используйте ':memory:', чтобы создать базу данных в памяти.

source: Check same thread or not, default is False. Set False to allow sharing connection across threads
fr: Vérifier si c'est le même thread ou non, la valeur par défaut est False. Réglez sur False pour autoriser le partage de connexion entre les threads.
ja: 同じスレッドかどうかを確認します。デフォルトは False です。False に設定すると、スレッド間で接続を共有できます。
ru: Проверять, используется ли один и тот же поток или нет, по умолчанию False. Установите False, чтобы разрешить общий доступ к соединению между потоками.

source: Driver name, default is sqlite
fr: Nom du pilote, la valeur par défaut est sqlite.
ja: ドライバ名。デフォルトはsqliteです。
ru: Имя драйвера, по умолчанию sqlite

source: MSSQL datasource
fr: Source de données MSSQL
ja: MSSQLデータソース
ru: MSSQL-источник данных

source: Powerful, scalable, secure relational database system by Microsoft.
fr: Système de base de données relationnelles puissant, évolutif et sécurisé de Microsoft.
ja: Microsoftによる強力で拡張性が高く、セキュアなリレーショナルデータベースシステム。
ru: Мощная, масштабируемая и безопасная система реляционных баз данных от Microsoft.

source: Driver name for MSSQL, default is mssql+pymssql.
fr: Nom du pilote pour MSSQL, la valeur par défaut est mssql+pymssql.
ja: MSSQLのドライバ名。デフォルトはmssql+pymssqlです。
ru: Имя драйвера для MSSQL, по умолчанию mssql+pymssql.

source: Apache Doris datasource
fr: Source de données Apache Doris
ja: Apache Dorisデータソース
ru: Apache Doris-источник данных

source: A new-generation open-source real-time data warehouse.
fr: Un entrepôt de données en temps réel open-source de nouvelle génération.
ja: 新世代のオープンソースのリアルタイムデータウェアハウス。
ru: Современный открытый реляционный аналитический сервер.

source: Driver name for Doris, default is doris.
fr: Nom du pilote pour Doris, la valeur par défaut est doris.
ja: Dorisのドライバ名。デフォルトはdorisです。
ru: Имя драйвера для Doris, по умолчанию doris.

source: Vertica datasource
fr: Source de données Vertica
ja: Verticaデータソース
ru: Источник данных Vertica

source: Vertica is a strongly consistent, ACID-compliant, SQL data warehouse, built for the scale and complexity of today`s data-driven world.
fr: Vertica est un entrepôt de données SQL fortement cohérent, conforme aux normes ACID, conçu pour l'échelle et la complexité du monde axé sur les données d'aujourd'hui.
ja: Verticaは、強い一貫性を持ち、ACID準拠のSQLデータウェアハウスで、今日のデータ駆動型の世界の規模と複雑さに対応して構築されています。
ru: Vertica - это строго согласованный, соответствующий стандартам ACID, SQL-аналитический сервер, разработанный для масштаба и сложности современного мира, основанного на данных.

source: Driver name for vertica, default is vertica+vertica_python
fr: Nom du pilote pour Vertica, la valeur par défaut est vertica+vertica_python
ja: Verticaのドライバ名。デフォルトはvertica+vertica_pythonです。
ru: Имя драйвера для Vertica, по умолчанию vertica+vertica_python

source: OceanBase datasource
fr: Source de données OceanBase
ja: OceanBaseデータソース
ru: Источник данных OceanBase

source: An Ultra-Fast & Cost-Effective Distributed SQL Database.
fr: Une base de données SQL distribuée ultra-rapide et économique.
ja: 超高速で費用対効果の高い分散型SQLデータベース。
ru: Ультрабыстрая и экономичная распределенная SQL-система управления базами данных.

source: Driver name for oceanbase, default is mysql+ob.
fr: Nom du pilote pour OceanBase, la valeur par défaut est mysql+ob.
ja: OceanBaseのドライバ名。デフォルトはmysql+obです。
ru: Имя драйвера для OceanBase, по умолчанию mysql+ob.

source: Clickhouse datasource
fr: Source de données ClickHouse
ja: ClickHouseデータソース
ru: Источник данных ClickHouse

source: Columnar database for high-performance analytics and real-time queries.
fr: Base de données colonnaire pour l'analyse haute performance et les requêtes en temps réel.
ja: 高性能な分析とリアルタイムクエリ用の列指向データベース。
ru: Колоночная база данных для высокопроизводительных аналитических и запросов в реальном времени.

source: Database host, e.g., localhost
fr: Hôte de la base de données, par exemple, localhost
ja: データベースホスト。例: localhost
ru: Хост базы данных, например, localhost

source: Database user to connect
fr: Utilisateur de base de données pour la connexion
ja: 接続するデータベースのユーザー
ru: Пользователь базы данных для подключения

source: Database name
fr: Nom de la base de données
ja: データベース名
ru: Имя базы данных

source: Storage engine, e.g., MergeTree
fr: Moteur de stockage, par exemple, MergeTree
ja: ストレージエンジン。例: MergeTree
ru: СУБД хранения, например, MergeTree

source: http pool maxsize
fr: Taille maximale du pool HTTP
ja: HTTPプールの最大サイズ
ru: Максимальный размер HTTP-пула

source: http pool num_pools
fr: Nombre de pools HTTP
ja: HTTPプールのプール数
ru: Количество пулов в HTTP-пуле

source: Database connect timeout, default 15s
fr: Délai d'attente de connexion à la base de données, par défaut 15 s
ja: データベース接続タイムアウト、デフォルトは15秒
ru: Тайм-аут подключения к базе данных, по умолчанию 15 с

source: Distributed ddl task timeout, default 300s
fr: Délai d'attente de la tâche DDL distribuée, par défaut 300 s
ja: 分散DDLタスクのタイムアウト、デフォルトは300秒
ru: Тайм-аут распределенной задачи DDL, по умолчанию 300 с

source: PostreSQL datasource
fr: Source de données PostgreSQL
ja: PostgreSQLデータソース
ru: Источник данных PostgreSQL

source: Powerful open-source relational database with extensibility and SQL standards.
fr: Puissante base de données relationnelle open-source avec extensibilité et normes SQL.
ja: 拡張性とSQL標準を備えた強力なオープンソースのリレーショナルデータベースです。
ru: Мощная открытая реляционная база данных с расширяемостью и соответствием стандартам SQL.

source: Database schema, defaults to 'public'
fr: Schéma de base de données, par défaut 'public'
ja: データベーススキーマ、デフォルトは'public'です
ru: Схема базы данных, по умолчанию 'public'

source: Driver name for postgres, default is postgresql+psycopg2.
fr: Nom du pilote pour PostgreSQL, par défaut postgresql+psycopg2.
ja: PostgreSQL用のドライバー名、デフォルトはpostgresql+psycopg2です。
ru: Имя драйвера для PostgreSQL, по умолчанию postgresql+psycopg2.

source: DuckDB datasource
fr: Source de données DuckDB
ja: DuckDBデータソース
ru: Источник данных DuckDB

source: In-memory analytical database with efficient query processing.
fr: Base de données analytique en mémoire avec traitement efficace des requêtes.
ja: 効率的なクエリ処理を備えたインメモリ分析データベースです。
ru: Внутренне-память аналитическая база данных с эффективной обработкой запросов.

source: Path to the DuckDB file.
fr: Chemin vers le fichier DuckDB.
ja: DuckDBファイルへのパスです。
ru: Путь к файлу DuckDB.

source: Driver name for DuckDB, default is duckdb.
fr: Nom du pilote pour DuckDB, la valeur par défaut est duckdb.
ja: DuckDB用のドライバー名、デフォルトはduckdbです。
ru: Имя драйвера для DuckDB, по умолчанию duckdb.
