Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_app_config.po
Languages: fr, ja, ru

source: Language setting
fr: Paramètre de langue
ja: 言語設定
ru: Настройка языка

source: Logging level
fr: Niveau de journalisation
ja: ログレベル
ru: Уровень логирования

source: API keys
fr: Clés API
ja: API キー
ru: Ключи API

source: The key to encrypt the data
fr: La clé pour chiffrer les données
ja: データを暗号化するキー
ru: Ключ для шифрования данных

source: default vector type
fr: type de vecteur par défaut
ja: デフォルトのベクトルタイプ
ru: Тип вектора по умолчанию

source: default graph type
fr: type de graphe par défaut
ja: デフォルトのグラフタイプ
ru: Тип графа по умолчанию

source: Whether to verify the SSL certificate of the database
fr: S'il faut vérifier le certificat SSL de la base de données
ja: データベースの SSL 証明書を検証するかどうか
ru: Проверять ли SSL-сертификат базы данных

source: The default thread pool size, If None, use default config of python thread pool
fr: La taille par défaut du pool de threads. Si None, utilise la configuration par défaut du pool de threads Python
ja: デフォルトのスレッドプールサイズ。None の場合は、Python スレッドプールのデフォルト設定を使用します
ru: Размер пула потоков по умолчанию. Если None, используется конфигурация пула потоков Python по умолчанию

source: knowledge search top k
fr: top k de recherche de connaissances
ja: 知識検索の上位 k 件
ru: Топ-k результатов поиска в знаниях

source: knowledge search top similarity score
fr: score de similarité top de recherche de connaissances
ja: 知識検索の類似度スコア上位
ru: Максимальный балл сходства при поиске в знаниях

source: knowledge search rewrite
fr: réécriture de recherche de connaissances
ja: 知識検索の書き換え
ru: Перезапись запроса при поиске в знаниях

source: knowledge max chunks once load
fr: nombre maximal de segments de connaissances chargés en une fois
ja: 一度に読み込む知識の最大チャンク数
ru: Максимальное количество блоков знаний при загрузке за один раз

source: knowledge max load thread
fr: nombre maximal de threads de chargement de connaissances
ja: 知識読み込みの最大スレッド数
ru: Максимальное количество потоков для загрузки знаний

source: knowledge rerank top k
fr: top k de reclassement de connaissances
ja: 知識再ランキングの上位 k 件
ru: Топ-k переранжированных результатов поиска в знаниях

source: Storage configuration
fr: Configuration de stockage
ja: ストレージ設定
ru: Конфигурация хранилища

source: knowledge graph search top k
fr: recherche top k du graphe de connaissances
ja: 知識グラフ検索の上位 k 件
ru: Топ-k результатов поиска в графе знаний

source: graph community summary enabled
fr: résumé de la communauté du graphe activé
ja: グラフコミュニティ要約が有効
ru: Включить обобщение сообществ графа

source: kg extract llm model
fr: Modèle LLM d'extraction de graphe de connaissances
ja: KG 抽出用の Large Language Model
ru: Модель LLM для извлечения из графа знаний

source: kg extract score threshold
fr: Seuil de score d'extraction de graphe de connaissances
ja: KG 抽出のスコア閾値
ru: Пороговое значение оценки для извлечения из графа знаний

source: kg community top k
fr: Top k de la communauté du graphe de connaissances
ja: KG コミュニティの上位 k 件
ru: Топ-k сообществ в графе знаний

source: kg_community_score_threshold
fr: Seuil de score de la communauté du graphe de connaissances
ja: KG コミュニティのスコア閾値
ru: Пороговое значение оценки сообществ в графе знаний

source: kg_triplet_graph_enabled
fr: Graphe de triplets de connaissances activé
ja: KG トリプレットグラフが有効
ru: Включить триплетный граф знаний

source: kg_document_graph_enabled
fr: Graphe de documents de connaissances activé
ja: KG ドキュメントグラフが有効
ru: Включить документный граф знаний

source: kg_chunk_search_top_k
fr: Recherche top k de segments de graphe de connaissances
ja: KG チャンク検索の上位 k 件
ru: Топ-k результатов поиска по блокам в графе знаний

source: kg_extraction_batch_size
fr: Taille du lot d'extraction de graphe de connaissances
ja: KG 抽出のバッチサイズ
ru: Размер пакета для извлечения из KG

source: kg_embedding_batch_size
fr: Taille du lot d'incorporation de graphe de connaissances
ja: KG 埋め込みバッチサイズ
ru: Размер пакета для эмбеддинга KG

source: kg_similarity_top_k
fr: Top k de similarité de graphe de connaissances
ja: KG 類似度上位 k 件
ru: Топ-k по сходству в KG

source: kg_similarity_score_threshold
fr: Seuil de score de similarité de graphe de connaissances
ja: KG 類似度スコア閾値
ru: Порог оценки сходства в KG

source: kg_enable_text_search
fr: Activation de la recherche textuelle dans la KG
ja: KG テキスト検索を有効化
ru: Включить текстовый поиск в KG

source: kg_text2gql_model_enabled
fr: Activation du modèle de conversion texte en GQL pour la KG
ja: KG テキストから GQL へのモデルを有効化
ru: Включить модель текста в GQL для KG

source: text2gql_model_name
fr: Nom du modèle de conversion texte en GQL
ja: テキストから GQL へのモデル名
ru: Название модели текста в GQL

source: bm25_k1
fr: Paramètre k1 de BM25
ja: BM25 の k1 パラメータ

source: bm25_b
fr: Paramètre b de BM25
ja: BM25 の b パラメータ

source: Webserver deploy host
fr: Hôte de déploiement du serveur web
ja: Web サーバー展開ホスト
ru: Хост для развертывания веб-сервера

source: Webserver deploy port, default is 5670
fr: Port de déploiement du serveur web, par défaut 5670
ja: Web サーバーのデプロイポート、デフォルトは 5670
ru: Порт для развертывания веб-сервера, по умолчанию 5670

source: Run Webserver in light mode
fr: Exécuter le serveur web en mode léger
ja: Web サーバーを軽量モードで実行する
ru: Запуск веб-сервера в легком режиме

source: The Model controller address to connect. If None, read model controller address from environment key `MODEL_SERVER`.
fr: Adresse du contrôleur de modèle à connecter. Si None, lire l'adresse du contrôleur de modèle à partir de la clé d'environnement `MODEL_SERVER`.
ja: 接続するモデルコントローラのアドレス。Noneの場合、環境変数 `MODEL_SERVER` からモデルコントローラのアドレスを読み取ります。
ru: Адрес контроллера модели для подключения. Если None, то адрес контроллера модели считывается из переменной окружения `MODEL_SERVER`.

source: Database connection config, now support SQLite, OceanBase and MySQL
fr: Configuration de connexion à la base de données, supporte actuellement SQLite, OceanBase et MySQL
ja: データベース接続設定。現在は、SQLite、OceanBase、MySQLをサポートしています。
ru: Конфигурация подключения к базе данных, в настоящее время поддерживаются SQLite, OceanBase и MySQL

source: The storage type of model configures, if None, use the default storage(current database). When you run in light mode, it will not use any storage.
fr: Le type de stockage des configurations de modèle, si None, utilise le stockage par défaut (base de données actuelle). Lorsque vous exécutez en mode léger, il n'utilisera aucun stockage.
ja: モデル設定のストレージタイプ。Noneの場合、デフォルトのストレージ（現在のデータベース）を使用します。ライトモードで実行する場合は、ストレージを使用しません。
ru: Тип хранилища для конфигураций модели. Если None, используется хранилище по умолчанию (текущая база данных). При запуске в легком режиме не используется никакое хранилище.

source: Tracer config for web server, if None, use global tracer config
fr: Configuration du traceur pour le serveur web, si None, utilisez la configuration globale du traceur
ja: Web サーバーのトレーサー設定。Noneの場合、グローバルなトレーサー設定を使用します。
ru: Конфигурация трассировщика для веб-сервера. Если None, используется глобальная конфигурация трассировщика

source: Logging configuration for web server, if None, use global config
fr: Configuration de journalisation pour le serveur web, si None, utilisez la configuration globale
ja: Webサーバーのログ設定です。Noneの場合、グローバル設定を使用します。
ru: Конфигурация логирования для веб-сервера. Если None, используется глобальная конфигурация

source: Whether to disable alembic to initialize and upgrade database metadata
fr: Si oui ou non désactiver Alembic pour initialiser et mettre à jour les métadonnées de la base de données
ja: Alembicを無効にしてデータベースのメタデータの初期化と更新を行わないかどうか
ru: Отключать ли Alembic для инициализации и обновления метаданных базы данных

source: Whether to enable remote embedding models. If it is True, you need to start a embedding model through `dbgpt start worker --worker_type text2vec --model_name xxx --model_path xxx`
fr: Si oui ou non activer les modèles d'embedding distants. Si c'est True, vous devez démarrer un modèle d'embedding via `dbgpt start worker --worker_type text2vec --model_name xxx --model_path xxx`
ja: リモート埋め込みモデルを有効にするかどうか。Trueの場合、`dbgpt start worker --worker_type text2vec --model_name xxx --model_path xxx` で埋め込みモデルを起動する必要があります。
ru: Включать ли удаленные модели эмбеддингов. Если True, необходимо запустить модель эмбеддингов с помощью команды `dbgpt start worker --worker_type text2vec --model_name xxx --model_path xxx`

source: Whether to enable remote rerank models. If it is True, you need to start a rerank model through `dbgpt start worker --worker_type text2vec --rerank --model_name xxx --model_path xxx`
fr: Indique si les modèles de rerank à distance doivent être activés. Si c'est True, vous devez démarrer un modèle de rerank via `dbgpt start worker --worker_type text2vec --rerank --model_name xxx --model_path xxx`
ja: リモート再ランキングモデルを有効にするかどうか。Trueの場合、`dbgpt start worker --worker_type text2vec --rerank --model_name xxx --model_path xxx` で再ランキングモデルを起動する必要があります。
ru: Включать ли удаленные модели переранжирования. Если значение равно True, вам нужно запустить модель переранжирования с помощью команды `dbgpt start worker --worker_type text2vec --rerank --model_name xxx --model_path xxx`

source: The directories to search awel files, split by `,`
fr: Les répertoires pour rechercher les fichiers awel, séparés par `,`
ja: AWELファイルを検索するディレクトリで、`,` で区切ります。
ru: Директории для поиска файлов AWEL, разделенные запятой `,`

source: Whether to use the new web UI, default is True
fr: Indique si la nouvelle interface web doit être utilisée, la valeur par défaut est True
ja: 新しいWeb UIを使用するかどうか。デフォルトはTrueです。
ru: Использовать ли новый веб-интерфейс, по умолчанию True

source: Model cache configuration
fr: Configuration du cache des modèles
ja: モデルキャッシュの設定
ru: Конфигурация кэша модели

source: The max sequence length of the embedding model, default is 512
fr: La longueur maximale de séquence du modèle d'embedding, la valeur par défaut est 512
ja: 埋め込みモデルの最大シーケンス長。デフォルトは 512 です。
ru: Максимальная длина последовательности для модели эмбеддинга, по умолчанию 512

source: Web service configuration
fr: Configuration du service web
ja: Web サービスの設定
ru: Конфигурация веб-сервиса

source: Model service configuration
fr: Configuration du service de modèles
ja: モデルサービスの設定
ru: Конфигурация сервиса модели

source: Configuration hooks, which will be executed before the configuration loading
fr: Hooks de configuration, qui seront exécutés avant le chargement de la configuration
ja: 設定読み込み前に実行される設定フック
ru: Хуки конфигурации, которые будут выполнены перед загрузкой конфигурации

source: System configuration
fr: Configuration du système
ja: システム設定
ru: Системная конфигурация

source: Model deployment configuration
fr: Configuration du déploiement des modèles
ja: モデル展開の設定
ru: Конфигурация развертывания модели

source: Serve configuration
fr: Configuration du service
ja: サービス設定
ru: Конфигурация сервера

source: Rag Knowledge Parameters
fr: Paramètres de connaissances RAG
ja: RAG 知識パラメータ
ru: Параметры знаний RAG

source: Global tracer configuration
fr: Configuration globale du traceur
ja: グローバルトレーサーの設定
ru: Конфигурация глобального трассировщика

source: Logging configuration
fr: Configuration de la journalisation
ja: ログ設定
ru: Конфигурация логирования
