Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_util.po
Languages: ko, ru, zh_cn

source: The module to scan, if not set, will scan all DB-GPT modules('dbgpt,dbgpt_client,dbgpt_ext,dbgpt_serve,dbgpt_app').
ko: 스캔할 모듈입니다. 설정하지 않으면 모든 DB-GPT 모듈('dbgpt,dbgpt_client,dbgpt_ext,dbgpt_serve,dbgpt_app')을 스캔합니다.
ru: Модуль для сканирования. Если не задан, будут просканированы все модули DB-GPT ('dbgpt,dbgpt_client,dbgpt_ext,dbgpt_serve,dbgpt_app').
zh_cn: 要扫描的模块，如果不设置，将扫描所有 DB-GPT 模块（'dbgpt、dbgpt_client、dbgpt_ext、dbgpt_serve、dbgpt_app'）。

source: The output path, if not set, will print to packages/dbgpt-serve/src/dbgpt_serve/flow/compat/
ko: 출력 경로입니다. 설정하지 않으면 packages/dbgpt-serve/src/dbgpt_serve/flow/compat/에 출력됩니다.
ru: Путь для вывода. Если не задан, вывод будет осуществлен в packages/dbgpt-serve/src/dbgpt_serve/flow/compat/
zh_cn: 输出路径，如果不设置，将输出到 packages/dbgpt-serve/src/dbgpt_serve/flow/compat/ 。

source: The current version of the flow, if not set, will read from dbgpt.__version__
ko: 현재 흐름의 버전입니다. 설정하지 않으면 dbgpt.__version__에서 읽어옵니다.
ru: Текущая версия потока. Если не задано, будет прочитано из dbgpt.__version__
zh_cn: 当前工作流版本，如果不设置，将从 dbgpt.__version__ 读取。

source: The last version to compatible, if not set, will big than the current version by one minor version.
ko: 호환 가능한 마지막 버전입니다. 설정하지 않으면 현재 버전보다 한 마이너 버전 높은 버전이 됩니다.
ru: Последняя совместимая версия. Если не задано, будет на одну неосновную версию больше текущей.
zh_cn: 最后兼容的版本，如果不设置，将比当前版本高一个小版本号。

source: Update the template file.
ko: 템플릿 파일을 업데이트합니다.
ru: Обновить файл шаблона.
zh_cn: 更新模板文件。

source: Repos
ko: 저장소들
ru: Репозитории
zh_cn: 仓库

source: Repository
ko: 저장소
ru: Репозиторий
zh_cn: 仓库

source: Path
ko: 경로
ru: Путь
zh_cn: 路径

source: dbgpts In All Repos
ko: 모든 저장소의 dbgpts
ru: dbgpts во всех репозиториях
zh_cn: 所有仓库中的 dbgpts

source: Type
ko: 유형
ru: Тип
zh_cn: 类型

source: Name
ko: 이름
ru: Имя
zh_cn: 名称

source: Installed dbgpts
ko: 설치된 DB-GPT
ru: Установленные DB-GPT
zh_cn: 已安装的 dbgpts

source: Json Serializer
ko: JSON 시리얼라이저
ru: JSON-сериализатор
zh_cn: JSON 序列化器

source: The serializer for serializing data with json format.
ko: 데이터를 JSON 형식으로 직렬화하는 시리얼라이저입니다.
ru: Сериализатор для сериализации данных в формате JSON.
zh_cn: 用于将数据序列化为 JSON 格式的序列化器。

source: Hook path, it can be a class path or a function path. eg: 'dbgpt.config.hooks.env_var_hook'
ko: 훅 경로입니다. 클래스 경로 또는 함수 경로일 수 있습니다. 예: 'dbgpt.config.hooks.env_var_hook'
ru: Путь к хуку, это может быть путь к классу или путь к функции. Например: 'dbgpt.config.hooks.env_var_hook'
zh_cn: 钩子路径，可以是类路径或函数路径。例如：'dbgpt.config.hooks.env_var_hook'

source: Hook init params to pass to the hook constructor(Just for class hook), must be key-value pairs
ko: 훅 생성자에 전달할 훅 초기 매개변수입니다(클래스 훅에만 해당). 키-값 쌍이어야 합니다.
ru: Параметры инициализации хука, которые передаются в конструктор хука (только для классового хука), должны быть парами ключ-значение
zh_cn: 传递给钩子构造函数的钩子初始化参数（仅适用于类钩子），必须是键值对

source: Hook params to pass to the hook, must be key-value pairs
ko: 훅에 전달할 훅 매개변수입니다. 키-값 쌍이어야 합니다.
ru: Параметры хуков, передаваемые в хук, должны быть парами ключ-значение
zh_cn: 传递给钩子的参数，必须为键值对

source: Whether the hook is enabled, default is True
ko: 훅이 활성화되었는지 여부입니다. 기본값은 True입니다.
ru: Включен ли хук, по умолчанию True
zh_cn: 钩子是否启用，默认为 True

source: Logging level, just support FATAL, ERROR, WARNING, INFO, DEBUG, NOTSET
ko: 로깅 수준은 FATAL, ERROR, WARNING, INFO, DEBUG, NOTSET만 지원합니다.
ru: Уровень логирования, поддерживаются только FATAL, ERROR, WARNING, INFO, DEBUG, NOTSET
zh_cn: 日志级别，仅支持 FATAL、ERROR、WARNING、INFO、DEBUG、NOTSET

source: The filename to store logs
ko: 로그를 저장할 파일명
ru: Имя файла для хранения журналов
zh_cn: 用于存储日志的文件名

source: The file to store the tracer, e.g. dbgpt_webserver_tracer.jsonl
ko: 트레이서를 저장할 파일입니다. 예: dbgpt_webserver_tracer.jsonl
ru: Файл для хранения трассировщика, например, dbgpt_webserver_tracer.jsonl
zh_cn: 用于存储跟踪器数据的文件，例如 dbgpt_webserver_tracer.jsonl

source: The root operation name of the tracer
ko: 트레이서의 루트 작업 이름
ru: Корневое имя операции трассировщика
zh_cn: 跟踪器的根操作名称

source: The exporter of the tracer, e.g. telemetry
ko: 트레이서의 익스포터입니다. 예: telemetry
ru: Экспортер трассировщика, например, телеметрия
zh_cn: 跟踪器的导出器，例如 telemetry

source: The endpoint of the OpenTelemetry Protocol, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}' to use the environment variable
ko: OpenTelemetry 프로토콜의 엔드포인트입니다. 환경 변수를 사용하려면 '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}'를 설정할 수 있습니다.
ru: Конечная точка протокола OpenTelemetry. Вы можете установить '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}', чтобы использовать переменную окружения
zh_cn: OpenTelemetry 协议的端点，您可以设置 '${env:OTEL_EXPORTER_OTLP_TRACES_ENDPOINT}' 来使用环境变量

source: Whether to use insecure connection, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}' to use the environment
ko: 비보안 연결을 사용할지 여부입니다. 환경 변수를 사용하려면 '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}'를 설정할 수 있습니다.
ru: Использовать ли незащищенное соединение. Вы можете установить '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}', чтобы использовать переменную окружения
zh_cn: 是否使用不安全连接，您可以设置 '${env:OTEL_EXPORTER_OTLP_TRACES_INSECURE}' 来使用环境变量

source: The timeout of the connection, in seconds, you can set '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}' to use the environment
ko: 연결 제한 시간(초)입니다. 환경 변수를 사용하려면 '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}'를 설정할 수 있습니다.
ru: Тайм-аут соединения в секундах. Вы можете установить '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}', чтобы использовать переменную окружения
zh_cn: 连接的超时时间（秒），您可以设置 '${env:OTEL_EXPORTER_OTLP_TRACES_TIMEOUT}' 来使用环境变量

source: The class of the tracer storage
ko: 트레이서 저장소의 클래스
ru: Класс хранилища трассировщика
zh_cn: 跟踪器存储的类
