Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_core.po
Languages: fr, ja, ru

source: 8-bit models can offload weights between the CPU and GPU to support fitting very large models into memory. The weights dispatched to the CPU are actually stored in float32, and aren’t converted to 8-bit.
fr: Les modèles 8 bits peuvent transférer les poids entre le CPU et le GPU pour permettre de charger de très grands modèles en mémoire. Les poids envoyés au CPU sont en réalité stockés au format float32 et ne sont pas convertis en 8 bits.
ja: 8ビットモデルは、CPUとGPU間で重みをオフロードすることができ、非常に大きなモデルをメモリに収めることをサポートします。CPUに割り当てられた重みは実際にはfloat32形式で保存され、8ビットに変換されません。
ru: 8-битные модели могут распределять веса между ЦП и ГПУ, чтобы поместить очень большие модели в память. Веса, отправляемые на ЦП, фактически хранятся в формате float32 и не преобразуются в 8-битный формат.

source: An “outlier” is a hidden state value greater than a certain threshold, and these values are computed in fp16. While the values are usually normally distributed ([-3.5, 3.5]), this distribution can be very different for large models ([-60, 6] or [6, 60]). 8-bit quantization works well for values ~5, but beyond that, there is a significant performance penalty. A good default threshold value is 6, but a lower threshold may be needed for more unstable models (small models or finetuning).
fr: Un « outlier » est une valeur d'état caché supérieure à un certain seuil, et ces valeurs sont calculées en fp16. Bien que les valeurs soient généralement distribuées normalement ([-3,5, 3,5]), cette distribution peut être très différente pour les grands modèles ([-60, 6] ou [6, 60]). La quantification 8 bits fonctionne bien pour les valeurs d'environ 5, mais au-delà, il y a une forte perte de performance. Une bonne valeur de seuil par défaut est 6, mais un seuil plus bas peut être nécessaire pour les modèles moins stables (petits modèles ou réglages fin).
ja: 「外れ値」とは、特定の閾値を超える隠れ状態の値を指し、これらの値はfp16で計算されます。通常、これらの値は正規分布します ([-3.5, 3.5]) が、大規模なモデルではこの分布が大きく異なる場合があります ([-60, 6] や [6, 60])。8ビット量子化は値が約5まではうまく機能しますが、それを超えるとパフォーマンスが著しく低下します。適切なデフォルトの閾値は6ですが、より不安定なモデル（小規模モデルやファインチューニング済みモデル）では、より低い閾値が必要になることがあります。
ru: «Выброс» - это значение скрытого состояния, превышающее определенный порог, и эти значения вычисляются в формате fp16. Хотя значения обычно имеют нормальное распределение ([-3.5, 3.5]), для крупных моделей это распределение может быть очень разным ([-60, 6] или [6, 60]). 8-битная квантование хорошо работает для значений ~5, но при выходе за эти пределы наблюдается значительное снижение производительности. Хорошим значением порога по умолчанию является 6, но для более нестабильных моделей (маленьких моделей или дообучения) может потребоваться более низкий порог.

source: An explicit list of the modules that we do not want to convert in 8-bit. This is useful for models such as Jukebox that has several heads in different places and not necessarily at the last position. For example for `CausalLM` models, the last `lm_head` is kept in its original `dtype`
fr: Une liste explicite des modules que nous ne voulons pas convertir en 8 bits. Cela est utile pour des modèles comme Jukebox qui ont plusieurs têtes en différents endroits et pas nécessairement à la dernière position. Par exemple, pour les modèles `CausalLM`, la dernière `lm_head` est conservée dans son `dtype` d'origine.
ja: 8ビットに変換したくないモジュールの明示的なリストです。これは、Jukeboxのように複数のヘッドが異なる位置にあり、必ずしも最後の位置にあるわけではないモデルに対して有用です。例えば、`CausalLM` モデルの場合、最後の `lm_head` は元の `dtype` のままに保たれます。
ru: Явный список модулей, которые мы не хотим преобразовывать в 8-битный формат. Это полезно для моделей, таких как Jukebox, у которой есть несколько голов в разных местах и не обязательно в последней позиции. Например, для моделей `CausalLM` последний `lm_head` сохраняется в исходном `dtype`.

source: Whether to load the model in 4 bits.
fr: Indique si le modèle doit être chargé en 4 bits.
ja: モデルを4ビットで読み込むかどうか。
ru: Загружать ли модель в 4-битном формате.

source: To speedup computation, you can change the data type from float32 (the default value) to bfloat16
fr: Pour accélérer les calculs, vous pouvez changer le type de données de float32 (valeur par défaut) à bfloat16
ja: 計算を高速化するためには、データ型を float32（デフォルト値）から bfloat16 に変更できます。
ru: Для ускорения вычислений вы можете изменить тип данных с float32 (значение по умолчанию) на bfloat16

source: Quantization datatypes, `fp4` (four bit float) and `nf4` (normal four bit float), only valid when load_4bit=True
ja: 量子化データ型 `fp4`（4ビット浮動小数点数）および `nf4`（通常の4ビット浮動小数点数）は、load_4bit=True の場合のみ有効です。
ru: Типы данных квантования `fp4` (четырёхбитный плавающий тип) и `nf4` (нормальный четырёхбитный плавающий тип) действительны только при load_4bit=True

source: Nested quantization is a technique that can save additional memory at no additional performance cost. This feature performs a second quantization of the already quantized weights to save an additional 0.4 bits/parameter.
fr: La quantification imbriquée est une technique qui peut économiser de la mémoire supplémentaire sans coût supplémentaire en termes de performances. Cette fonction effectue une seconde quantification des poids déjà quantifiés pour économiser 0,4 bits supplémentaires par paramètre.
ja: ネストされた量子化は、追加のパフォーマンスコストを伴わずにさらにメモリを節約できる技術です。この機能は、すでに量子化された重みに対して二次量子化を行い、さらに0.4ビット/パラメータを節約します。
ru: Вложенное квантование - это техника, которая позволяет сэкономить дополнительную память без потери производительности. Эта функция выполняет второе квантование уже квантованных весов, чтобы сэкономить дополнительно 0,4 бит на параметр.

source: The host IP address to bind to.
fr: L'adresse IP de l'hôte à laquelle se lier.
ja: バインドするホストIPアドレスです。
ru: IP-адрес хоста, к которому нужно привязаться.

source: The port number to bind to.
fr: Le numéro de port auquel se lier.
ja: バインドするポート番号です。
ru: Номер порта, к которому нужно привязаться.

source: Run the server as a daemon.
fr: Exécuter le serveur en tant que démon.
ja: サーバーをデーモンとして実行します。
ru: Запустить сервер как демон.

source: Logging configuration
fr: Configuration de journalisation
ja: ログ設定
ru: Конфигурация логирования

source: Tracer configuration
fr: Configuration du traceur
ja: トレーサー設定
ru: Конфигурация трассировщика

source: Build Model Request
fr: Construire une requête de modèle
ja: モデルリクエストの構築
ru: Создать запрос на модель

source: Build the model request from the http request body.
fr: Construire la requête de modèle à partir du corps de la requête HTTP.
ja: HTTPリクエストボディからモデルリクエストを構築します。
ru: Создать запрос на модель из тела HTTP-запроса.

source: Default Model Name
fr: Nom de modèle par défaut
ja: デフォルトのモデル名
ru: Имя модели по умолчанию

source: The model name of the model request.
fr: Le nom du modèle de la requête de modèle.
ja: モデルリクエストのモデル名です。
ru: Имя модели в запросе на модель.

source: Temperature
fr: Température
ja: 温度
ru: Температура

source: The temperature of the model request.
fr: La température de la requête de modèle.
ja: モデルリクエストの温度です。
ru: Температура в запросе на модель.

source: Max New Tokens
fr: Nombre maximum de nouveaux tokens
ja: 最大新トークン数
ru: Максимальное количество новых токенов

source: The max new tokens of the model request.
fr: Le nombre maximum de nouveaux tokens de la requête de modèle.
ja: モデルリクエストの最大新トークン数です。
ru: Максимальное количество новых токенов в запросе на модель.

source: Context Length
fr: Longueur du contexte
ja: コンテキスト長
ru: Длина контекста

source: The context length of the model request.
fr: La longueur du contexte de la requête du modèle.
ja: モデルリクエストのコンテキスト長です。
ru: Длина контекста запроса модели.

source: The input value of the operator.
fr: La valeur d'entrée de l'opérateur.
ja: オペレーターの入力値です。
ru: Входное значение оператора.

source: The output value of the operator.
fr: La valeur de sortie de l'opérateur.
ja: オペレーターの出力値。
ru: Выходное значение оператора.

source: Merge Model Request Messages
fr: Fusionner les messages de la requête du modèle
ja: モデル要求メッセージの統合
ru: Объединить сообщения запроса модели

source: Merge the model request from the input value.
fr: Fusionner la requête du modèle à partir de la valeur d'entrée.
ja: 入力値からモデル要求を統合します。
ru: Объединить запрос модели из входного значения.

source: The model request of upstream.
fr: La requête du modèle en amont.
ja: 上流からのモデル要求。
ru: Запрос модели от предыдущего этапа.

source: Model messages
fr: Messages du modèle
ja: モデルメッセージ
ru: Сообщения модели

source: The model messages of upstream.
fr: Les messages du modèle en amont.
ja: 上流からのモデルメッセージ。
ru: Сообщения модели от предыдущего этапа.

source: LLM Branch Operator
fr: Opérateur de branche LLM
ja: LLM 分岐オペレーター
ru: LLM ветвляющийся оператор

source: Branch the workflow based on the stream flag of the request.
fr: Divertir le flux de travail en fonction du drapeau de flux de la requête.
ja: リクエストのストリームフラグに基づいてワークフローを分岐します。
ru: Разветвить рабочий процесс на основе флага потоковой передачи запроса.

source: Streaming Model Request
fr: Requête de modèle en flux
ja: ストリーミングモデル要求
ru: Запрос на модель с потоковой передачей

source: The streaming request, to streaming Operator.
fr: La requête en flux, pour l'opérateur en flux.
ja: ストリーミング要求、ストリーミングオペレーター用。
ru: Запрос на потоковую передачу, направленный на оператор потоковой передачи.

source: Non-Streaming Model Request
fr: Requête de modèle non en flux
ja: ノンストリーミングモデル要求
ru: Запрос на модель без потоковой передачи

source: The non-streaming request, to non-streaming Operator.
fr: La requête non en flux, pour l'opérateur non en flux.
ja: ノンストリーミング要求、ノンストリーミングオペレーター用。
ru: Запрос без потоковой передачи, направленный на оператор без потоковой передачи.

source: Map Model Output to Common Response Body
fr: Mapper la sortie du modèle au corps de réponse commun
ja: モデル出力を共通レスポンスボディにマッピング
ru: Преобразовать выходные данные модели в общий формат тела ответа

source: Map the model output to the common response body.
fr: Mapper la sortie du modèle au corps de réponse commun.
ja: モデル出力を共通レスポンスボディにマッピングします。
ru: Преобразовать выходные данные модели в общий формат тела ответа.

source: Common Response Body
fr: Corps de réponse commun
ja: 共通レスポンスボディ
ru: Общий формат тела ответа

source: Common Streaming Output Operator
fr: Opérateur de sortie en flux commun
ja: 共通ストリーミング出力オペレーター
ru: Общий оператор потокового вывода

source: The common streaming LLM operator, for chat flow.
fr: L'opérateur LLM de streaming commun, destiné au flux de conversation.
ja: チャットフロー用の共通ストリーミングLLMオペレーター。
ru: Общий оператор потоковой передачи LLM для чат-рабочего процесса.

source: Upstream Model Output
fr: Sortie du modèle en amont
ja: アップストリームモデル出力
ru: Выходные данные модели верхнего уровня

source: The model output after transform to common stream format
fr: La sortie du modèle après transformation au format de flux commun
ja: 共通ストリーム形式に変換後のモデル出力
ru: Выходные данные модели после преобразования в общий формат потоковой передачи

source: Map String to ModelOutput
fr: Mapper une chaîne de caractères vers ModelOutput
ja: 文字列をModelOutputにマッピング
ru: Преобразовать строку в выходные данные модели

source: Map String to ModelOutput.
fr: Mapper une chaîne de caractères vers ModelOutput.
ja: 文字列をModelOutputにマップします。
ru: Преобразовать строку в выходные данные модели.

source: String
fr: Chaîne de caractères
ja: 文字列
ru: Строка

source: LLM Branch Join Operator
fr: Opérateur de jonction de branches LLM
ja: LLM分岐結合演算子
ru: LLM 分支合并算子

source: Just keep the first non-empty output.
fr: Conservez simplement la première sortie non vide.
ja: 最初の非空出力のみを保持します。
ru: Просто сохраняйте первый непустой вывод.

source: Streaming Model Output
fr: Sortie en streaming du modèle
ja: ストリーミングモデル出力
ru: Потоковый вывод модели

source: The streaming output.
fr: La sortie en streaming.
ja: ストリーミング出力。
ru: Потоковый вывод.

source: Non-Streaming Model Output
fr: Sortie non en streaming du modèle
ja: 非ストリーミングモデル出力
ru: Не-потоковый вывод модели

source: The non-streaming output.
fr: La sortie non en flux.
ja: 非ストリーミング出力。
ru: Не-потоковый вывод.

source: String Branch Join Operator
fr: Opérateur de jonction de branches de chaînes
ja: 文字列分岐結合演算子
ru: Оператор объединения строковых ветвей

source: Streaming String Output
fr: Sortie en flux de chaîne
ja: ストリーミング文字列出力
ru: Потоковый вывод строки

source: Non-Streaming String Output
fr: Sortie non en flux de chaîne
ja: 非ストリーミング文字列出力
ru: Не-потоковый вывод строки

source: String Output
fr: Sortie de chaîne
ja: 文字列出力
ru: Вывод строки

source: Chat History Load Operator
fr: Opérateur de chargement de l'historique de chat
ja: チャット履歴読み込み演算子
ru: Оператор загрузки чат- истории

source: The operator to load chat history from storage.
fr: L'opérateur pour charger l'historique de chat à partir du stockage.
ja: ストレージからチャット履歴を読み込む演算子。
ru: Оператор для загрузки чат- истории из хранилища.

source: The conversation storage, store the conversation items(Not include message items). If None, we will use InMemoryStorage.
fr: Le stockage de conversation, stocke les éléments de conversation (n'inclut pas les éléments de message). Si None, nous utiliserons InMemoryStorage.
ja: 会話の保存、会話項目（メッセージ項目は含まない）を保存します。None の場合は、InMemoryStorage を使用します。
ru: Хранилище разговоров, которое хранит элементы разговора (не включая элементы сообщений). Если значение равно None, мы будем использовать InMemoryStorage.

source: The message storage, store the messages of one conversation. If None, we will use InMemoryStorage.
fr: Le stockage de messages, stocke les messages d'une conversation. Si None, nous utiliserons InMemoryStorage.
ja: メッセージの保存先で、1つの会話のメッセージを保存します。None の場合は、InMemoryStorage を使用します。
ru: Хранилище сообщений, которое хранит сообщения одного разговора. Если значение равно None, мы будем использовать InMemoryStorage.

source: The model request.
fr: La requête du modèle.
ja: モデルへのリクエストです。
ru: Запрос модели.

source: Stored Messages
fr: Messages stockés
ja: 保存されたメッセージ
ru: Сохраненные сообщения

source: The messages stored in the storage.
fr: Les messages stockés dans le stockage.
ja: ストレージに保存されているメッセージです。
ru: Сообщения, сохраненные в хранилище.

source: Common Chat Prompt Template
fr: Modèle de prompt de chat courant
ja: 共通チャットプロンプトテンプレート
ru: Общий шаблон промпта для чата

source: The operator to build the prompt with static prompt.
fr: L'opérateur pour construire le prompt avec un prompt statique.
ja: 静的なプロンプトを使用してプロンプトを作成するオペレーターです。
ru: Оператор для создания промпта с использованием статического промпта.

source: System Message
fr: Message système
ja: システムメッセージ
ru: Системное сообщение

source: The system message.
fr: Le message système.
ja: システムメッセージです。
ru: Системное сообщение.

source: Message placeholder
fr: Espace réservé pour les messages
ja: メッセージのプレースホルダー
ru: Заглушка для сообщения

source: The chat history message placeholder.
fr: L'espace réservé pour les messages de l'historique de chat.
ja: チャット履歴メッセージのプレースホルダーです。
ru: Заглушка для сообщений истории чата.

source: Human Message
fr: Message humain
ja: ヒューマンメッセージ
ru: Сообщение пользователя

source: The human message.
fr: Le message humain.
ja: ヒューマンメッセージです。
ru: Сообщение пользователя.

source: Prompt Builder Operator
fr: Opérateur de construction de prompt
ja: プロンプトビルダーオペレーター
ru: Оператор построения промпта

source: Build messages from prompt template.
fr: Construit des messages à partir d'un modèle de prompt.
ja: プロンプトテンプレートからメッセージを作成します。
ru: Создать сообщения из шаблона промпта.

source: Chat Prompt Template
fr: Modèle de prompt de chat
ja: チャットプロンプトテンプレート
ru: Шаблон чат-промпта

source: The chat prompt template.
fr: Le modèle de prompt de chat.
ja: チャットプロンプトテンプレートです。
ru: Шаблон чат-промпта.

source: Prompt Input Dict
fr: Dictionnaire d'entrée de prompt
ja: プロンプト入力辞書
ru: Словарь входных промптов

source: The prompt dict.
fr: Le dictionnaire de prompt.
ja: プロンプト辞書です。
ru: Словарь промптов.

source: Formatted Messages
fr: Messages formatés
ja: フォーマットされたメッセージ
ru: Отформатированные сообщения

source: The formatted messages.
fr: Les messages formatés.
ja: フォーマットされたメッセージ。
ru: Отформатированные сообщения.

source: History Prompt Builder Operator
fr: Opérateur de construction de prompt d'historique
ja: 履歴プロンプトビルダーオペレーター
ru: Оператор построения исторических промптов

source: Build messages from prompt template and chat history.
fr: Construire des messages à partir du modèle de prompt et de l'historique de chat.
ja: プロンプトテンプレートとチャット履歴からメッセージを構築します。
ru: Создавать сообщения из шаблона промпта и чат- истории.

source: The key of history in prompt dict.
fr: La clé de l'historique dans le dictionnaire de prompt.
ja: プロンプト辞書内の履歴のキー。
ru: Ключ истории в словаре промптов.

source: String History
fr: Historique en chaîne de caractères
ja: 文字列履歴
ru: История в виде строки

source: Whether to convert the history to string.
fr: Indique si l'historique doit être converti en chaîne de caractères.
ja: 履歴を文字列に変換するかどうか。
ru: Преобразовывать ли историю в строку.

source: History
fr: Historique
ja: 履歴
ru: История

source: The history.
fr: L'historique.
ja: 履歴。
ru: История.

source: The media data
fr: Les données multimédias
ja: メディアデータ
ru: Медиа-данные

source: The media object
fr: L'objet multimédia
ja: メディアオブジェクト
ru: Медиа-объект
