Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_ext_rag.po
Languages: fr, ja

source: Chunk Parameters
fr: Paramètres de segmentation
ja: チャンクパラメータ

source: Chunk Strategy
fr: Stratégie de segmentation
ja: チャンク戦略

source: chunk strategy
fr: stratégie de segmentation
ja: チャンク戦略

source: Text Splitter
fr: Diviseur de texte
ja: テキスト分割器

source: Text splitter, if not set, will use the default text splitter.
fr: Diviseur de texte. Si non défini, le diviseur de texte par défaut sera utilisé.
ja: テキスト分割器が設定されていない場合、デフォルトのテキスト分割器が使用されます。

source: Splitter Type
fr: Type de diviseur
ja: 分割器タイプ

source: Splitter type
fr: type de diviseur
ja: 分割器タイプ

source: Chunk Size
fr: Taille de segmentation
ja: チャンクサイズ

source: Chunk size
fr: taille de segmentation
ja: チャンクサイズ

source: Chunk Overlap
fr: Chevauchement de segmentation
ja: チャンク重複

source: Separator
fr: Séparateur
ja: 区切り文字

source: Chunk separator
fr: Séparateur de segmentation
ja: チャンク区切り文字

source: Enable Merge
fr: Activer la fusion
ja: マージを有効にする

source: Enable chunk merge by chunk_size.
fr: Activer la fusion des segments par taille de segment.
ja: チャンクサイズによるチャンクマージを有効にします。

source: The API key for the embeddings API.
fr: La clé API pour l'API d'incorporation.
ja: 埋め込みAPI用のAPIキーです。

source: The Secret key for the embeddings API. It's the sk for qianfan.
fr: La clé secrète pour l'API d'incorporation. C'est la clé secrète pour Qianfan.
ja: 埋め込みAPI用のシークレットキーです。これは千帆のskです。

source: The real model name to pass to the provider, default is None. If backend is None, use name as the real model name.
fr: Le véritable nom du modèle à passer au fournisseur, la valeur par défaut est None. Si le backend est None, utilisez le nom comme véritable nom du modèle.
ja: プロバイダに渡す実際のモデル名です。デフォルトはNoneです。バックエンドがNoneの場合、名前を実際のモデル名として使用します。

source: Embedding-V1 by Baidu Qianfan.
fr: Embedding-V1 par Baidu Qianfan.
ja: 百度千帆によるEmbedding-V1です。

source: The URL of the embeddings API.
fr: L'URL de l'API d'incorporation.
ja: 埋め込みAPIのURL。

source: The embedding model are trained by BAAI, it support more than 100 working languages.
fr: Le modèle d'incorporation est entraîné par BAAI, il prend en charge plus de 100 langues de travail.
ja: この埋め込みモデルはBAAIによって訓練され、100以上の作業言語をサポートしています。

source: The name of the model to use for text embeddings.
fr: Le nom du modèle à utiliser pour les incorporations de texte.
ja: テキスト埋め込みに使用するモデルの名前。

source: Jina AI Embeddings
fr: Incorporations Jina AI
ja: Jina AI 埋め込み

source: Jina AI embeddings.
fr: Incorporations Jina AI.
ja: Jina AI 埋め込み。

source: API Key
fr: Clé API
ja: API キー

source: Your API key for the Jina AI API.
fr: Votre clé API pour l'API Jina AI.
ja: Jina AI API用のAPIキーです。

source: Model Name
fr: Nom du modèle
ja: モデル名

source: The embedding model are trained by TongYi, it support more than 50 working languages.
fr: Le modèle d'incorporation est entraîné par TongYi et prend en charge plus de 50 langues de travail.
ja: この埋め込みモデルは通義によって訓練されており、50以上の作業言語をサポートしています。

source: Knowledge Graph Operator
fr: Opérateur de graphe de connaissances
ja: 知識グラフ オペレーター

source: Extract Documents and persist into graph database.
fr: Extraire les documents et les conserver dans une base de données de graphe.
ja: ドキュメントを抽出し、グラフデータベースに保存します。

source: Knowledge Graph Connector
fr: Connecteur de graphe de connaissances
ja: 知識グラフ コネクター

source: The knowledge graph.
fr: Le graphe de connaissances.
ja: 知識グラフです。

source: Chunks
fr: Morceaux
ja: チャンク

source: The text split chunks by chunk manager.
fr: Le texte divisé en segments par le gestionnaire de segments.
ja: チャンクマネージャーによって分割されたテキストチャンクです。

source: The assembled chunks, it has been persisted to graph store.
fr: Les segments assemblés ont été persistés dans le magasin de graphes.
ja: 組み立てられたチャンクは、グラフストアに保存されています。

source: Summary Operator
fr: Opérateur de synthèse
ja: 要約オペレーター

source: The summary assembler operator.
fr: L'opérateur d'assemblage de synthèse.
ja: 要約アセンブラーオペレーターです。

source: Knowledge
fr: Connaissance
ja: 知識

source: Knowledge datasource
fr: Source de données de connaissances
ja: 知識データソース

source: Document summary
fr: Synthèse de document
ja: ドキュメントの要約

source: LLM Client
fr: Client LLM
ja: LLM クライアント

source: The LLM Client.
fr: Le client LLM.
ja: LLM クライアントです。

source: Model name
fr: Nom du modèle
ja: モデル名

source: LLM model name
fr: Nom du modèle LLM
ja: LLM モデル名

source: prompt language
fr: Langue de l'invite
ja: プロンプト言語

source: Max iteration with LLM
fr: Nombre maximal d'itérations avec le LLM
ja: LLM との最大反復回数

source: Concurrency limit with LLM
fr: Limite de concurrence avec le LLM
ja: LLM との同時実行数制限

source: The concurrency limit with llm
fr: La limite de concurrence avec le LLM
ja: LLM との同時実行数制限

source: Embedding Retriever Operator
fr: Opérateur de récupération d'embeddings
ja: 埋め込み検索オペレーター

source: Retrieve candidates from vector store.
fr: Récupérer les candidats depuis le stockage vectoriel.
ja: ベクトルストアから候補を検索します。

source: Storage Index Store
fr: Stockage d'index de stockage
ja: ストレージインデックスストア

source: The vector store connector.
fr: Le connecteur du stockage vectoriel.
ja: ベクトルストアコネクターです。

source: Top K
ja: 上位 K 件

source: The number of candidates.
fr: Le nombre de candidats.
ja: 候補の数です。

source: Score Threshold
fr: Seuil de score
ja: スコア閾値

source: The score threshold, if score of candidate is less than it, it will be filtered.
fr: Le seuil de score. Si le score d'un candidat est inférieur à ce seuil, il sera filtré.
ja: スコア閾値です。候補のスコアがこの値より低い場合、フィルタリングされます。

source: Query Rewrite
fr: Réécriture de requête
ja: クエリ書き換え

source: The query rewrite resource.
fr: La ressource de réécriture de requête.
ja: クエリ書き換えリソースです。

source: Rerank
fr: Réclassement
ja: 再ランキング

source: The rerank.
fr: Le réclassement.
ja: 再ランキングです。

source: Query
fr: Requête
ja: クエリ

source: The query to retrieve.
fr: La requête à récupérer.
ja: 検索するクエリです。

source: Candidates
fr: Candidats
ja: 候補

source: The retrieved candidates.
fr: Les candidats récupérés.
ja: 検索された候補です。

source: Embedding Assembler Operator
fr: Opérateur d'assemblage d'embeddings
ja: 埋め込みアセンブラーオペレーター

source: Load knowledge and assemble embedding chunks to vector store.
fr: Charger les connaissances et assembler les morceaux d'embeddings dans le stockage vectoriel.
ja: 知識を読み込み、埋め込みチャンクをベクトルストアにアセンブルします。

source: Vector Store Connector
fr: Connecteur de stockage vectoriel
ja: ベクトルストアコネクター

source: The chunk parameters.
fr: Les paramètres des morceaux.
ja: チャンクパラメーターです。

source: The knowledge to be loaded.
fr: Les connaissances à charger.
ja: 読み込む知識です。

source: The assembled chunks, it has been persisted to vector store.
fr: Les morceaux assemblés ont été persistés dans le stockage vectoriel.
ja: アセンブルされたチャンクで、ベクトルストアに保存されています。

source: Knowledge Loader Operator
fr: Opérateur de chargement de connaissances
ja: 知識ローダーオペレーター

source: The knowledge operator, which can create knowledge from datasource.
fr: L'opérateur de connaissances, qui peut créer des connaissances à partir d'une source de données.
ja: データソースから知識を作成できる知識オペレーターです。

source: knowledge datasource
fr: Source de données de connaissances
ja: 知識データソース

source: knowledge datasource, which can be a document, url, or text.
fr: Source de données de connaissances, qui peut être un document, une URL ou un texte.
ja: ドキュメント、URL、またはテキストとなることができる知識データソースです。

source: Knowledge object.
fr: Objet de connaissance.
ja: 知識オブジェクトです。

source: Default datasource
fr: Source de données par défaut
ja: デフォルトのデータソース

source: Default datasource.
fr: Source de données par défaut.
ja: デフォルトのデータソースです。

source: Knowledge type
fr: Type de connaissance
ja: 知識タイプ

source: Knowledge type.
fr: Type de connaissance.
ja: 知識タイプです。

source: Chunks To String Operator
fr: Opérateur de conversion de segments en chaîne
ja: チャンクを文字列に変換するオペレーター

source: Convert chunks to string.
fr: Convertir les segments en chaîne.
ja: チャンクを文字列に変換します。

source: The separator between chunks.
fr: Le séparateur entre les segments.
ja: チャンク間の区切り文字です。

source: The input chunks.
fr: Les segments d'entrée.
ja: 入力されたチャンクです。

source: String
fr: Chaîne
ja: 文字列

source: The output string.
fr: La chaîne de sortie.
ja: 出力される文字列です。

source: Knowledge Process Branch Operator
fr: Opérateur de branchement du processus de connaissance
ja: 知識処理分岐オペレーター

source: Branch the workflow based on the stream flag of the request.
fr: Brancher le flux de travail en fonction du drapeau de flux de la demande.
ja: リクエストのストリームフラグに基づいてワークフローを分岐させます。

source: Document Chunks
fr: Segments de document
ja: ドキュメントチャンク

source: The input value of the operator.
fr: La valeur d'entrée de l'opérateur.
ja: オペレーターの入力値です。

source: Chunks for Vector Storage Connector.
fr: Segments pour le connecteur de stockage vectoriel.
ja: ベクトルストレージコネクター用のチャンクです。

source: Chunks for Knowledge Graph Connector.
fr: Morceaux pour le connecteur de graphe de connaissances.
ja: 知識グラフコネクター用のチャンクです。

source: Chunks for Full Text Connector.
fr: Morceaux pour le connecteur de texte intégral.
ja: 全文検索コネクター用のチャンクです。

source: Knowledge Process Join Operator
fr: Opérateur de jointure de traitement des connaissances
ja: 知識処理結合オペレーター

source: Join Branch the workflow based on the Knowledge Process Results.
fr: Joindre une branche du flux de travail en fonction des résultats du traitement des connaissances.
ja: 知識処理結果に基づいてワークフローを結合します。

source: Vector Storage Results
fr: Résultats du stockage vectoriel
ja: ベクトルストレージの結果

source: vector storage results.
fr: résultats du stockage vectoriel.
ja: ベクトルストレージの結果です。

source: Knowledge Graph Storage Results
fr: Résultats du stockage du graphe de connaissances
ja: 知識グラフストレージの結果

source: knowledge graph storage results.
fr: résultats du stockage du graphe de connaissances.
ja: 知識グラフの保存結果です。

source: Knowledge Process Results.
fr: Résultats du traitement des connaissances.
ja: 知識処理結果です。

source: Full Text Storage Operator
fr: Opérateur de stockage de texte intégral
ja: 全文ストレージオペレーター

source: Persist embeddings into full text storage.
fr: Conserver les incorporations dans le stockage de texte intégral.
ja: 埋め込みを全文ストレージに保存します。

source: Full Text Connector
fr: Connecteur de texte intégral
ja: 全文コネクター

source: The full text store.
fr: Le stockage de texte intégral.
ja: 全文ストアです。

source: The assembled chunks, it has been persisted to full text store.
fr: Les morceaux assemblés ont été enregistrés dans le stockage de texte intégral.
ja: 組み立てられたチャンクは、全文ストアに保存されています。

source: Vector Storage Operator
fr: Opérateur de stockage vectoriel
ja: ベクトルストレージオペレーター

source: Persist embeddings into vector storage.
fr: Conserver les incorporations dans le stockage vectoriel.
ja: 埋め込みをベクトルストレージに保存します。

source: The vector store.
fr: Le stockage de vecteurs.
ja: ベクトルストアです。
