Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_agent.po
Languages: fr, ko, ru, zh_cn

source: Agent Branch Operator
fr: Opérateur de branchement d'Agent
ko: 에이전트 분기 연산자
ru: Агентский ветвящий оператор
zh_cn: 智能体分支算子

source: Branch the workflow based on the agent actionreport nexspeakers of the request.
fr: Brancher le flux de travail en fonction du rapport d'action de l'Agent et des prochains intervenants de la requête.
ko: 요청의 에이전트 액션 보고서 다음 발화자에 따라 워크플로를 분기합니다.
ru: Ветвить рабочий процесс на основе следующих участников в отчете о действиях агента по запросу.
zh_cn: 根据请求的智能体操作报告中的 nexspeakers 分支工作流。

source: Agent Request
fr: Requête d'Agent
ko: 에이전트 요청
ru: Запрос агента
zh_cn: 智能体请求

source: The input value of the operator.
fr: La valeur d'entrée de l'opérateur.
ko: 연산자의 입력 값입니다.
ru: Входное значение оператора.
zh_cn: 算子的输入值。

source: The agent request to agent Operator.
fr: La requête d'Agent à l'opérateur d'Agent.
ko: 에이전트 연산자에 대한 에이전트 요청입니다.
ru: Запрос агента к агентскому оператору.
zh_cn: 发送给智能体算子的请求。

source: Agent Branch Join Operator
fr: Opérateur de jonction de branchement d'Agent
ko: 에이전트 분기 결합 연산자
ru: Агентский оператор объединения ветвей
zh_cn: 智能体分支合并算子

source: Just keep the first non-empty output.
fr: Conserver uniquement la première sortie non vide.
ko: 첫 번째 비어 있지 않은 출력만 유지합니다.
ru: Просто сохраняйте первый непустой вывод.
zh_cn: 仅保留第一个非空输出。

source: Agent Output
fr: Sortie d'Agent
ko: 에이전트 출력
ru: Вывод агента
zh_cn: 智能体输出

source: The Agent output.
fr: La sortie de l'Agent.
ko: 에이전트 출력입니다.
ru: Вывод агента.
zh_cn: 智能体的输出。

source: Branch Output
fr: Sortie de branche
ko: 분기 출력
ru: Вывод ветви
zh_cn: 分支输出

source: The output value of the operator.
fr: La valeur de sortie de l'opérateur.
ko: 연산자의 출력 값입니다.
ru: Выходное значение оператора.
zh_cn: 算子的输出值。
