Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_client.po
Languages: fr, ja, ko, ru

source: The name of the flow
fr: Le nom du flux
ja: フローの名前
ko: 플로우의 이름
ru: Имя потока

source: The uid of the flow
fr: L'UID du flux
ja: フローのUID
ko: 플로우의 UID
ru: UID потока

source: The messages of the flow
fr: Les messages du flux
ja: フローのメッセージ
ko: 플로우의 메시지
ru: Сообщения потока

source: The model of the flow
fr: Le modèle du flux
ja: フローのモデル
ko: 플로우의 모델
ru: Модель потока

source: Whether to stream the flow, default is False
fr: Indique si le flux doit être diffusé en continu, par défaut False
ja: フローをストリーミングするかどうか、デフォルトはFalse
ko: 플로우를 스트리밍할지 여부, 기본값은 False
ru: Потоковая передача, по умолчанию False

source: The temperature of the flow
fr: La température du flux
ja: フローの温度
ko: 플로우의 온도
ru: Температура потока

source: The max new tokens of the flow
fr: Le nombre maximal de nouveaux tokens du flux
ja: フローの最大新トークン数
ko: 플로우의 최대 새 토큰
ru: Максимальное количество новых токенов потока

source: The conversation id of the flow
fr: L'identifiant de conversation du flux
ja: フローの会話ID
ko: 플로우의 대화 ID
ru: Идентификатор беседы потока

source: The json data of the flow
fr: Les données JSON du flux
ja: フローのJSONデータ
ko: 플로우의 JSON 데이터
ru: JSON-данные потока

source: The extra json data of the flow
fr: Les données JSON supplémentaires du flux
ja: フローの追加のJSONデータ
ko: 플로우의 추가 JSON 데이터
ru: Дополнительные JSON-данные потока
