Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_app_operators.po
Languages: fr, ja, ru

source: Context Key
fr: Clé de contexte
ja: コンテキストキー
ru: Ключ контекста

source: The key of the context, it will be used in building the prompt
fr: La clé du contexte, elle sera utilisée pour construire l'invite
ja: コンテキストのキーです。プロンプトの構築に使用されます。
ru: Ключ контекста, который будет использован при построении запроса

source: Top K
ja: トップK
ru: Топ K

source: The number of chunks to retrieve
fr: Le nombre de segments à récupérer
ja: 取得するチャンクの数
ru: Количество фрагментов для извлечения

source: Minimum Match Score
fr: Score de correspondance minimum
ja: 最小一致スコア
ru: Минимальный балл совпадения

source: The minimum match score for the retrieved chunks, it will be dropped if the match score is less than the threshold
fr: Le score de correspondance minimum pour les segments récupérés, il sera écarté si le score de correspondance est inférieur au seuil
ja: 取得したチャンクの最小一致スコアです。一致スコアが閾値を下回る場合、そのデータは破棄されます。
ru: Минимальный балл совпадения для извлеченных фрагментов. Фрагмент будет отброшен, если балл совпадения меньше порогового значения

source: Reranker Enabled
fr: Reranker activé
ja: 再ランキング機能有効
ru: Переранжировщик включен

source: Whether to enable the reranker
fr: Indique si le reranker doit être activé
ja: 再ランキング機能を有効にするかどうか
ru: Включать ли переранжировщик

source: Reranker Top K
fr: Top K du reranker
ja: 再ランキングトップK
ru: Топ K переранжировщика

source: The top k for the reranker
fr: Le top k pour le reranker
ja: 再ランキングのトップK
ru: Топ k для переранжировщика

source: User question
fr: Question de l'utilisateur
ja: ユーザーの質問
ru: Вопрос пользователя

source: The user question to retrieve the knowledge
fr: La question de l'utilisateur pour récupérer les connaissances
ja: 知識を取得するためのユーザーの質問
ru: Вопрос пользователя для извлечения знаний

source: Retrieved context
fr: Contexte récupéré
ja: 取得したコンテキスト
ru: Извлеченный контекст

source: The retrieved context from the knowledge space
fr: Le contexte récupéré de l'espace de connaissances
ja: 知識空間から取得したコンテキスト
ru: Извлеченный контекст из пространства знаний

source: Knowledge Space Operator
fr: Opérateur d'espace de connaissances
ja: 知識空間オペレーター
ru: Оператор пространства знаний

source: Knowledge Space Operator, retrieve your knowledge from knowledge space
fr: Opérateur d'espace de connaissances, récupérez vos connaissances de l'espace de connaissances
ja: 知識空間オペレーター。知識空間から知識を取得します。
ru: Оператор пространства знаний, извлеките свои знания из пространства знаний

source: Knowledge Space Name
fr: Nom de l'espace de connaissances
ja: 知識空間名
ru: Название пространства знаний

source: The name of the knowledge space
fr: Le nom de l'espace de connaissances
ja: 知識空間の名前
ru: Название пространства знаний

source: Chunks
fr: Morceaux
ja: チャンク
ru: Части

source: The retrieved chunks from the knowledge space
fr: Les morceaux récupérés de l'espace de connaissances
ja: 知識空間から取得したチャンク
ru: Извлеченные части из пространства знаний

source: String
fr: Chaîne
ja: 文字列
ru: Строка

source: The string to be converted to other types.
fr: La chaîne à convertir en d'autres types.
ja: 他の型に変換される文字列です。
ru: Строка, которая будет преобразована в другие типы.

source: Integer
fr: Entier
ja: 整数
ru: Целое число

source: The integer to be converted to other types.
fr: L'entier à convertir en d'autres types.
ja: 他の型に変換される整数です。
ru: Целое число, которое будет преобразовано в другие типы.

source: Float
fr: Flottant
ja: 浮動小数点数
ru: Число с плавающей точкой

source: The float to be converted to other types.
fr: Le flottant à convertir en d'autres types.
ja: 他の型に変換される浮動小数点数です。
ru: Число с плавающей точкой, которое будет преобразовано в другие типы.

source: Boolean
fr: Booléen
ja: ブール値
ru: Логическое значение

source: The boolean to be converted to other types.
fr: Le booléen à convertir en d'autres types.
ja: 他の型に変換されるブール値です。
ru: Логическое значение, которое должно быть преобразовано в другие типы.

source: The string converted from other types.
fr: La chaîne convertie à partir d'autres types.
ja: 他の型から変換された文字列です。
ru: Строка, полученная в результате преобразования из других типов.

source: The integer converted from other types.
fr: L'entier converti à partir d'autres types.
ja: 他の型から変換された整数です。
ru: Целое число, полученное в результате преобразования из других типов.

source: The float converted from other types.
fr: Le flottant converti à partir d'autres types.
ja: 他の型から変換された浮動小数点数です。
ru: Число с плавающей точкой, полученное в результате преобразования из других типов.

source: The boolean converted from other types.
fr: Le booléen converti à partir d'autres types.
ja: 他の型から変換されたブール値です。
ru: Логическое значение, полученное в результате преобразования из других типов.

source: String to Integer
fr: Chaîne vers Entier
ja: 文字列から整数へ
ru: Преобразование строки в целое число

source: Converts a string to an integer.
fr: Convertit une chaîne en un entier.
ja: 文字列を整数に変換します。
ru: Преобразует строку в целое число.

source: String to Float
fr: Chaîne vers Flottant
ja: 文字列から浮動小数点数へ
ru: Преобразование строки в число с плавающей точкой

source: Converts a string to a float.
fr: Convertit une chaîne en un nombre flottant.
ja: 文字列を浮動小数点数に変換します。
ru: Преобразует строку в число с плавающей точкой.

source: String to Boolean
fr: Chaîne vers Booléen
ja: 文字列からブール値へ
ru: Преобразование строки в логическое значение

source: Converts a string to a boolean, true: 'true', '1', 'y'
fr: Convertit une chaîne en un booléen, vrai : 'true', '1', 'y'
ja: 文字列をブール値に変換します。真の値: 'true', '1', 'y'
ru: Преобразует строку в логическое значение, истинные значения: 'true', '1', 'y'

source: True Values
fr: Valeurs Vraies
ja: 真の値
ru: Истинные значения

source: Comma-separated values that should be treated as True.
fr: Valeurs séparées par des virgules qui doivent être considérées comme vraies.
ja: カンマで区切られた値で、真として扱うべきものです。
ru: Значения, разделенные запятыми, которые должны быть восприниматься как истинные.

source: Integer to String
fr: Entier vers Chaîne
ja: 整数から文字列へ
ru: Преобразование целого числа в строку

source: Converts an integer to a string.
fr: Convertit un entier en une chaîne.
ja: 整数を文字列に変換します。
ru: Преобразует целое число в строку.

source: Float to String
fr: Flottant vers Chaîne
ja: 浮動小数点数から文字列へ
ru: Преобразование числа с плавающей точкой в строку

source: Converts a float to a string.
fr: Convertit un nombre flottant en une chaîne de caractères.
ja: 浮動小数点数を文字列に変換します。
ru: Преобразует число с плавающей точкой в строку.

source: Boolean to String
fr: Conversion de booléen en chaîne de caractères
ja: ブール値から文字列へ
ru: Преобразование булевого значения в строку

source: Converts a boolean to a string.
fr: Convertit un booléen en chaîne de caractères.
ja: ブール値を文字列に変換します。
ru: Преобразует булево значение в строку.

source: Model Output to Dict
fr: Conversion de la sortie du modèle en dictionnaire
ja: モデル出力を辞書に変換
ru: Преобразование выходных данных модели в словарь

source: Converts a model output to a dictionary.
fr: Convertit une sortie de modèle en dictionnaire.
ja: モデルの出力を辞書に変換します。
ru: Преобразует выходные данные модели в словарь.

source: Model Output
fr: Sortie du modèle
ja: モデル出力
ru: Выходные данные модели

source: Dictionary
fr: Dictionnaire
ja: 辞書
ru: Словарь

source: Datasource
fr: Source de données
ja: データソース
ru: Источник данных

source: The datasource to retrieve the context
fr: La source de données pour récupérer le contexte
ja: コンテキストを取得するデータソース
ru: Источник данных для получения контекста

source: Prompt Template
fr: Modèle de prompt
ja: プロンプトテンプレート
ru: Шаблон запроса

source: The prompt template to build a database prompt
fr: Le modèle de prompt pour construire un prompt de base de données
ja: データベースプロンプトを作成するためのプロンプトテンプレート
ru: Шаблон запроса для создания запроса к базе данных

source: Display Type
fr: Type d'affichage
ja: 表示タイプ
ru: Тип отображения

source: The display type for the data
fr: Le type d'affichage pour les données
ja: データの表示タイプ
ru: Тип отображения данных

source: Max Number of Results
fr: Nombre maximum de résultats
ja: 最大結果数
ru: Максимальное количество результатов

source: The maximum number of results to return
fr: Le nombre maximum de résultats à retourner
ja: 返す最大結果数
ru: Максимальное количество возвращаемых результатов

source: Response Format
fr: Format de réponse
ja: レスポンス形式
ru: Формат ответа

source: The response format, default is a JSON format
fr: Le format de réponse, par défaut un format JSON
ja: レスポンス形式で、デフォルトはJSON形式です。
ru: Формат ответа, по умолчанию - формат JSON

source: The user question to retrieve table schemas from the datasource
fr: La question de l'utilisateur pour récupérer les schémas de table à partir de la source de données
ja: データソースからテーブルスキーマを取得するためのユーザーの質問
ru: Вопрос пользователя для получения схем таблиц из источника данных

source: The retrieved context from the datasource
fr: Le contexte récupéré à partir de la source de données
ja: データソースから取得したコンテキスト
ru: Полученный контекст из источника данных

source: SQL dict
fr: Dictionnaire SQL
ja: SQL 辞書
ru: Словарь SQL

source: The SQL to be executed wrapped in a dictionary, generated by LLM
fr: Le SQL à exécuter encapsulé dans un dictionnaire, généré par le LLM
ja: LLM によって生成され、辞書にラップされた実行対象の SQL
ru: SQL-запрос, обернутый в словарь и сгенерированный Large Language Model

source: SQL result
fr: Résultat SQL
ja: SQL 実行結果
ru: Результат SQL-запроса

source: The result of the SQL execution
fr: Le résultat de l'exécution du SQL
ja: SQL の実行結果
ru: Результат выполнения SQL-запроса

source: SQL dict list
fr: Liste de dictionnaires SQL
ja: SQL 辞書リスト
ru: Список словарей SQL

source: The SQL list to be executed wrapped in a dictionary, generated by LLM
fr: La liste SQL à exécuter, encapsulée dans un dictionnaire, générée par le Grand Modèle de Langage
ja: LLM によって生成され、辞書にラップされた実行対象の SQL リスト
ru: Список SQL-запросов, обернутых в словарь и сгенерированный Large Language Model

source: Datasource Retriever Operator
fr: Opérateur de récupération des données sources
ja: データソース取得オペレーター
ru: Оператор извлечения данных из источника

source: Retrieve the table schemas from the datasource.
fr: Récupérer les schémas de table à partir de la source de données.
ja: データソースからテーブルスキーマを取得します。
ru: Извлечь схемы таблиц из источника данных.

source: Retrieved schema chunks
fr: Morceaux de schéma récupérés
ja: 取得したスキーマチャンク
ru: Полученные фрагменты схемы

source: The retrieved schema chunks from the datasource
fr: Les morceaux de schéma récupérés à partir de la source de données
ja: データソースから取得したスキーマチャンク
ru: Полученные фрагменты схемы из источника данных

source: Datasource Executor Operator
fr: Opérateur d'exécution des données sources
ja: データソース実行オペレーター
ru: Оператор выполнения запросов к источнику данных

source: Execute the context from the datasource.
fr: Exécuter le contexte provenant de la source de données.
ja: データソースからのコンテキストを実行します。
ru: Выполнить контекст из источника данных.

source: Datasource Dashboard Operator
fr: Opérateur du tableau de bord des données sources
ja: データソースダッシュボードオペレーター
ru: Оператор панели мониторинга источника данных

source: Code Map Operator
fr: Opérateur de carte de code
ja: コードマップオペレーター
ru: Оператор карты кода

source: Handle input dictionary with code and return output dictionary after execution.
fr: Traiter le dictionnaire d'entrée contenant le code et retourner le dictionnaire de sortie après exécution.
ja: コードを含む入力辞書を処理し、実行後の出力辞書を返します。
ru: Обработать входной словарь с кодом и вернуть выходной словарь после выполнения.

source: Code Editor
fr: Éditeur de code
ja: コードエディター
ru: Редактор кода

source: Please input your code
fr: Veuillez saisir votre code
ja: コードを入力してください。
ru: Пожалуйста, введите ваш код

source: The code to be executed.
fr: Le code à exécuter.
ja: 実行するコードです。
ru: Код, который необходимо выполнить.

source: Language
fr: Langage
ja: 言語
ru: Язык

source: Please select the language
fr: Veuillez sélectionner le langage
ja: 言語を選択してください。
ru: Пожалуйста, выберите язык

source: The language of the code.
fr: Le langage du code.
ja: コードの言語です。
ru: Язык кода.

source: Call Name
fr: Nom d'appel
ja: 呼び出し名
ru: Название вызова

source: Please input the call name
fr: Veuillez saisir le nom d'appel
ja: 呼び出し名を入力してください。
ru: Пожалуйста, введите название вызова

source: The call name of the function.
fr: Le nom d'appel de la fonction.
ja: 関数の呼び出し名です。
ru: Имя вызова функции.

source: Input Data
fr: Données d'entrée
ja: 入力データ
ru: Входные данные

source: The input dictionary.
fr: Le dictionnaire d'entrée.
ja: 入力辞書です。
ru: Входной словарь.

source: Output Data
fr: Données de sortie
ja: 出力データ
ru: Выходные данные

source: The output dictionary.
fr: Le dictionnaire de sortie.
ja: 出力辞書です。
ru: Выходной словарь.

source: Code Dict to Model Request Operator
fr: Opérateur de conversion de dictionnaire de code en requête de modèle
ja: コード辞書からモデルリクエストへのオペレーター
ru: Оператор преобразования словаря кода в запрос модели

source: Handle input dictionary with code and return output ModelRequest after execution.
fr: Traite le dictionnaire d'entrée avec du code et retourne une ModelRequest de sortie après exécution.
ja: コードで入力辞書を処理し、実行後に出力モデルリクエストを返します。
ru: Обработать входной словарь с кодом и вернуть выходной запрос модели (ModelRequest) после выполнения.

source: The output ModelRequest.
fr: La ModelRequest de sortie.
ja: 出力モデルリクエストです。
ru: Выходной запрос модели (ModelRequest).

source: The context key can be used as the key for formatting prompt.
fr: La clé de contexte peut être utilisée comme clé pour formater l'invite.
ja: コンテキストキーは、プロンプトをフォーマットするためのキーとして使用できます。
ru: Ключ контекста может быть использован в качестве ключа для форматирования промпта.

source: The context.
fr: Le contexte.
ja: コンテキストです。
ru: Контекст.

source: You are a helpful AI assistant.
fr: Vous êtes un assistant IA utile.
ja: あなたは役に立つAIアシスタントです。
ru: Вы полезный помощник ИИ.

source: The prompt template for the conversation.
fr: Le modèle d'invite pour la conversation.
ja: 会話用のプロンプトテンプレートです。
ru: Шаблон промпта для разговора.

source: Model Name
fr: Nom du modèle
ja: モデル名
ru: Название модели

source: The model name.
fr: Le nom du modèle.
ja: モデル名です。
ru: Название модели.

source: LLM Client
fr: Client LLM
ja: LLM クライアント
ru: LLM 客户端

source: The LLM Client, how to connect to the LLM model, if not provided, it will use the default client deployed by DB-GPT.
fr: Le client LLM, comment se connecter au modèle LLM. Si non fourni, il utilisera le client par défaut déployé par DB-GPT.
ja: LLM クライアントは、LLM モデルへの接続方法を指定します。提供されない場合、DB-GPT によって展開されたデフォルトのクライアントが使用されます。
ru: LLM-клиент, как подключиться к LLM-модели. Если не указан, будет использоваться стандартный клиент, развернутый DB-GPT.

source: History Message Merge Mode
fr: Mode de fusion des messages historiques
ja: 履歴メッセージのマージモード
ru: Режим объединения исторических сообщений

source: The history merge mode, supports 'none', 'window' and 'token'. 'none': no history merge, 'window': merge by conversation window, 'token': merge by token length.
fr: Le mode de fusion de l'historique prend en charge 'none', 'window' et 'token'. 'none' : pas de fusion de l'historique, 'window' : fusion par fenêtre de conversation, 'token' : fusion par longueur de token.
ja: 履歴マージモードは、'none'（履歴をマージしない）、'window'（会話ウィンドウ単位でマージ）、'token'（トークン長でマージ）をサポートします。
ru: Режим объединения истории поддерживает значения 'none', 'window' и 'token'. 'none': не объединять историю; 'window': объединять по окну разговора; 'token': объединять по длине токена.

source: User Message Key
fr: Clé du message utilisateur
ja: ユーザーメッセージキー
ru: Ключ пользовательского сообщения

source: The key of the user message in your prompt, default is 'user_input'.
fr: La clé du message de l'utilisateur dans votre invite, la valeur par défaut est 'user_input'.
ja: プロンプト内のユーザーメッセージのキーです。デフォルトは 'user_input' です。
ru: Ключ пользовательского сообщения в вашем запросе, по умолчанию 'user_input'.

source: History Key
fr: Clé de l'historique
ja: 履歴キー
ru: Ключ истории

source: The chat history key, with chat history message pass to prompt template, if not provided, it will parse the prompt template to get the key.
fr: La clé de l'historique de chat, avec le message de l'historique de chat transmis au modèle de prompt. Si elle n'est pas fournie, le modèle de prompt sera analysé pour obtenir la clé.
ja: チャット履歴メッセージをプロンプトテンプレートに渡すためのチャット履歴キーです。指定されていない場合、プロンプトテンプレートを解析してキーを取得します。
ru: Ключ истории чата. Сообщения истории чата передаются в шаблон подсказки. Если ключ не указан, он будет получен путем разбора шаблона подсказки.

source: Keep Start Rounds
fr: Conserver les tours initiaux
ja: 開始ラウンドを保持する
ru: Сохранять начальные раунды

source: The start rounds to keep in the chat history.
fr: Les tours initiaux à conserver dans l'historique de chat.
ja: チャット履歴で保持する開始ラウンド数です。
ru: Начальные раунды, которые нужно сохранить в истории чата.

source: Keep End Rounds
fr: Conserver les tours finaux
ja: 終了ラウンドを保持する
ru: Сохранять конечные раунды

source: The end rounds to keep in the chat history.
fr: Les tours finaux à conserver dans l'historique de chat.
ja: チャット履歴で保持する終了ラウンド数です。
ru: Конечные раунды, которые нужно сохранить в истории чата.

source: Max Token Limit
fr: Limite maximale de tokens
ja: 最大トークン制限
ru: Максимальное ограничение по токенам

source: The max token limit to keep in the chat history.
fr: La limite maximale de tokens à conserver dans l'historique de chat.
ja: チャット履歴で保持する最大トークン数の制限です。
ru: Максимальное ограничение по токенам, которое нужно сохранить в истории чата.

source: Common LLM Request Body
fr: Corps de requête LLM commun
ja: 一般的なLLMリクエストボディ
ru: Общее тело запроса LLM

source: The common LLM request body.
fr: Le corps de requête LLM commun.
ja: 一般的なLLMリクエストボディです。
ru: Общее тело запроса LLM.

source: Extra Context
fr: Contexte supplémentaire
ja: 追加コンテキスト
ru: Дополнительный контекст

source: Extra context for building prompt(Knowledge context, database schema, etc), you can add multiple context.
fr: Contexte supplémentaire pour la construction de l'invite (contexte de connaissances, schéma de base de données, etc.), vous pouvez ajouter plusieurs contextes.
ja: プロンプトを作成するための追加コンテキスト（知識コンテキスト、データベーススキーマなど）で、複数のコンテキストを追加できます。
ru: Дополнительный контекст для создания промпта (контекст знаний, схема базы данных и т. д.), вы можете добавить несколько контекстов.

source: The model output.
fr: La sortie du modèle.
ja: モデルの出力です。
ru: Вывод модели.

source: Streaming Model Output
fr: Sortie de modèle en streaming
ja: ストリーミングモデル出力
ru: Потоковый вывод модели

source: The streaming model output.
fr: La sortie du modèle en streaming.
ja: ストリーミングモデルの出力です。
ru: Потоковый вывод модели.

source: LLM Operator
fr: Opérateur LLM
ja: LLMオペレーター
ru: LLM Оператор

source: High-level LLM operator, supports multi-round conversation (conversation window, token length and no multi-round).
fr: Opérateur LLM de haut niveau, prend en charge les conversations multi-tours (fenêtre de conversation, longueur des tokens et sans multi-tours).
ja: 高レベルなLLMオペレーターで、マルチラウンド会話（会話ウィンドウ、トークン長、非マルチラウンド）をサポートします。
ru: Высокоуровневый LLM оператор, поддерживает многоразовые диалоги (окно диалога, длина токена и отсутствие многоразовых диалогов).

source: Streaming LLM Operator
fr: Opérateur LLM en streaming
ja: ストリーミングLLMオペレーター
ru: Потоковый LLM Оператор

source: High-level streaming LLM operator, supports multi-round conversation (conversation window, token length and no multi-round).
fr: Opérateur LLM de streaming de haut niveau, qui prend en charge les conversations multi-tours (fenêtre de conversation, longueur des tokens et sans multi-tours).
ja: 高度なストリーミングLLMオペレーターで、マルチラウンド会話（会話ウィンドウ、トークン長、非マルチラウンド）をサポートします。
ru: Высокоуровневый потоковый LLM-оператор, поддерживает многоразовые диалоги (окно диалога, длина токена и отсутствие многоразовых диалогов).
