Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_storage.po
Languages: fr, ko, ru

source: Chroma Vector Store
fr: Magasin de vecteurs chromatiques
ko: 크로마 벡터 저장소
ru: Хроматическое векторное хранилище

source: Chroma vector store.
fr: Magasin de vecteurs chromatiques.
ko: 크로마 벡터 저장소.
ru: Хроматическое векторное хранилище.

source: Persist Path
fr: Chemin de persistance
ko: 지속 경로
ru: Путь сохранения

source: the persist path of vector store.
fr: le chemin de persistance du magasin de vecteurs.
ko: 벡터 저장소의 지속 경로.
ru: путь сохранения векторного хранилища.

source: Milvus Vector Store
fr: Magasin de vecteurs Milvus
ko: Milvus 벡터 저장소
ru: Хранилище векторов Milvus

source: The uri of milvus store, if not set, will use the default uri.
fr: L'URI du magasin Milvus, s'il n'est pas défini, utilisera l'URI par défaut.
ko: Milvus 저장소의 URI입니다. 설정되지 않으면 기본 URI를 사용합니다.
ru: URI хранилища Milvus, если не установлено, будет использоваться URI по умолчанию.

source: Port
ko: 포트
ru: Порт

source: The port of milvus store, if not set, will use the default port.
fr: Le port du magasin Milvus, s'il n'est pas défini, utilisera le port par défaut.
ko: Milvus 저장소의 포트입니다. 설정되지 않으면 기본 포트를 사용합니다.
ru: Порт хранилища Milvus, если не установлен, будет использоваться порт по умолчанию.

source: Alias
ko: 별칭
ru: Псевдоним

source: The alias of milvus store, if not set, will use the default alias.
fr: L'alias du magasin Milvus, s'il n'est pas défini, utilisera l'alias par défaut.
ko: Milvus 저장소의 별칭입니다. 설정되지 않으면 기본 별칭을 사용합니다.
ru: Псевдоним хранилища Milvus, если не установлен, будет использоваться псевдоним по умолчанию.

source: Primary Field
fr: Champ primaire
ko: 기본 필드
ru: Основное поле

source: The primary field of milvus store, if not set, will use the default primary field.
fr: Le champ primaire du magasin Milvus, s'il n'est pas défini, utilisera le champ primaire par défaut.
ko: Milvus 저장소의 기본 필드입니다. 설정되지 않으면 기본 기본 필드를 사용합니다.
ru: Основное поле хранилища Milvus, если не установлено, будет использоваться основное поле по умолчанию.

source: Text Field
fr: Champ de texte
ko: 텍스트 필드
ru: Текстовое поле

source: The text field of milvus store, if not set, will use the default text field.
fr: Le champ de texte du magasin Milvus, s'il n'est pas défini, utilisera le champ de texte par défaut.
ko: Milvus 저장소의 텍스트 필드입니다. 설정되지 않으면 기본 텍스트 필드를 사용합니다.
ru: Текстовое поле хранилища Milvus, если не установлено, будет использоваться текстовое поле по умолчанию.

source: Embedding Field
fr: Champ d'incorporation
ko: 임베딩 필드
ru: Поле вложения

source: The embedding field of milvus store, if not set, will use the default embedding field.
fr: Le champ d'incorporation du magasin Milvus, s'il n'est pas défini, utilisera le champ d'incorporation par défaut.
ko: Milvus 저장소의 임베딩 필드입니다. 설정되지 않으면 기본 임베딩 필드를 사용합니다.
ru: Поле вложения хранилища Milvus, если не установлено, будет использоваться поле вложения по умолчанию.

source: Milvus vector store.
fr: Magasin de vecteurs Milvus.
ko: Milvus 벡터 저장소.
ru: Хранилище векторов Milvus.

source: Vector Store Connector
fr: Connecteur de magasin de vecteurs
ko: 벡터 저장소 커넥터
ru: Коннектор векторного хранилища

source: Vector Store Type
fr: Type de magasin de vecteurs
ko: 벡터 저장소 유형
ru: Тип векторного хранилища

source: The type of vector store.
fr: Le type de magasin de vecteurs.
ko: 벡터 저장소의 유형입니다.
ru: Тип векторного хранилища.

source: Vector Store Implementation
fr: Implémentation du magasin de vecteurs
ko: 벡터 저장소 구현
ru: Реализация векторного хранилища

source: The vector store implementation.
fr: L'implémentation du magasin de vecteurs.
ko: 벡터 저장소의 구현입니다.
ru: Реализация векторного хранилища.

source: Weaviate Vector Store
fr: Magasin de vecteurs Weaviate
ko: Weaviate 벡터 저장소
ru: Хранилище векторов Weaviate

source: Weaviate vector store.
fr: Magasin de vecteurs Weaviate.
ko: Weaviate 벡터 저장소.
ru: Хранилище векторов Weaviate.

source: Weaviate URL
fr: URL Weaviate
ru: URL Weaviate

source: weaviate url address, if not set, will use the default url.
fr: adresse URL Weaviate, si non définie, utilisera l'URL par défaut.
ko: Weaviate URL 주소입니다. 설정되지 않으면 기본 URL을 사용합니다.
ru: адрес URL Weaviate, если не установлен, будет использоваться URL по умолчанию.

source: PG Vector Store
fr: Magasin de vecteurs PG
ko: PG 벡터 저장소
ru: Хранилище векторов PG

source: Connection String
fr: Chaîne de connexion
ko: 연결 문자열
ru: Строка подключения

source: The connection string of vector store, if not set, will use the default connection string.
fr: La chaîne de connexion du magasin de vecteurs, si elle n'est pas définie, utilisera la chaîne de connexion par défaut.
ko: 벡터 저장소의 연결 문자열입니다. 설정되지 않으면 기본 연결 문자열을 사용합니다.
ru: Строка подключения векторного хранилища, если не установлено, будет использоваться строка подключения по умолчанию.

source: Collection Name
fr: Nom de la collection
ko: 컬렉션 이름
ru: Имя коллекции

source: The name of vector store, if not set, will use the default name.
fr: Le nom du magasin de vecteurs, s'il n'est pas défini, utilisera le nom par défaut.
ko: 벡터 저장소의 이름입니다. 설정되지 않으면 기본 이름을 사용합니다.
ru: Имя векторного хранилища, если не установлено, будет использоваться имя по умолчанию.

source: User
fr: Utilisateur
ko: 사용자
ru: Пользователь

source: The user of vector store, if not set, will use the default user.
fr: L'utilisateur du magasin de vecteurs, s'il n'est pas défini, utilisera l'utilisateur par défaut.
ko: 벡터 저장소의 사용자입니다. 설정되지 않으면 기본 사용자를 사용합니다.
ru: Пользователь векторного хранилища, если не установлен, будет использоваться пользователь по умолчанию.

source: Password
fr: Mot de passe
ko: 암호
ru: Пароль

source: The password of vector store, if not set, will use the default password.
fr: Le mot de passe du magasin de vecteurs, s'il n'est pas défini, utilisera le mot de passe par défaut.
ko: 벡터 저장소의 암호를 설정하지 않으면 기본 암호를 사용합니다.
ru: Пароль хранилища векторов, если не установлен, будет использовать пароль по умолчанию.

source: Embedding Function
fr: Fonction d'incorporation
ko: 임베딩 함수
ru: Функция встраивания

source: The embedding function of vector store, if not set, will use the default embedding function.
fr: La fonction d'incorporation du magasin de vecteurs, si elle n'est pas définie, utilisera la fonction d'incorporation par défaut.
ko: 벡터 저장소의 임베딩 함수를 설정하지 않으면 기본 임베딩 함수를 사용합니다.
ru: Функция встраивания хранилища векторов, если не установлена, будет использовать функцию встраивания по умолчанию.

source: Max Chunks Once Load
fr: Nombre maximal de morceaux chargés à la fois
ko: 한 번에 로드할 최대 청크 수
ru: Максимальное количество чанков для одновременной загрузки

source: The max number of chunks to load at once. If your document is large, you can set this value to a larger number to speed up the loading process. Default is 10.
fr: Le nombre maximal de morceaux à charger à la fois. Si votre document est volumineux, vous pouvez définir cette valeur sur un nombre plus élevé pour accélérer le processus de chargement. Par défaut, il est de 10.
ko: 한 번에 로드할 청크 수의 최대값입니다. 문서가 크다면 로딩 프로세스를 가속화하기 위해 이 값을 더 큰 수로 설정할 수 있습니다. 기본값은 10입니다.
ru: Максимальное количество чанков для одновременной загрузки. Если ваш документ большой, вы можете установить это значение больше, чтобы ускорить процесс загрузки. По умолчанию - 10.

source: Max Threads
fr: Nombre maximal de threads
ko: 최대 스레드 수
ru: Максимальное количество потоков

source: The max number of threads to use. Default is 1. If you set this bigger than 1, please make sure your vector store is thread-safe.
fr: Le nombre maximal de threads à utiliser. Par défaut, il est de 1. Si vous le définissez sur une valeur supérieure à 1, veuillez vous assurer que votre magasin de vecteurs est sûr pour les threads.
ko: 사용할 최대 스레드 수입니다. 기본값은 1입니다. 이 값을 1보다 크게 설정하면 벡터 저장소가 스레드 안전한지 확인해주세요.
ru: Максимальное количество потоков для использования. По умолчанию - 1. Если вы установите значение больше 1, убедитесь, что ваше хранилище векторов поддерживает многопоточность.
