Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_serve_flow.po
Languages: fr, ja, ru

source: All AWEL Flows
fr: Tous les flux AWEL
ja: すべての AWEL フロー
ru: Все AWEL потоки

source: Fetch all AWEL flows in the system
fr: Récupérer tous les flux AWEL dans le système
ja: システム内のすべての AWEL フローを取得します
ru: Получить все AWEL потоки в системе

source: All AWEL Flow Nodes
fr: Tous les nœuds de flux AWEL
ja: すべての AWEL フローノード
ru: Все узлы AWEL потоков

source: Fetch all AWEL flow nodes in the system
fr: Récupérer tous les nœuds de flux AWEL dans le système
ja: システム内のすべての AWEL フローノードを取得します
ru: Получить все узлы AWEL потоков в системе

source: All Variables
fr: Toutes les variables
ja: すべての変数
ru: Все переменные

source: Fetch all variables in the system
fr: Récupérer toutes les variables dans le système
ja: システム内のすべての変数を取得します
ru: Получить все переменные в системе

source: All Secrets
fr: Tous les secrets
ja: すべてのシークレット
ru: Все секреты

source: Fetch all secrets in the system
fr: Récupérer tous les secrets dans le système
ja: システム内のすべてのシークレットを取得します
ru: Получить все секреты в системе

source: All LLMs
fr: Toutes les Grandes Modèles de Langage
ja: すべての Large Language Model
ru: Все Large Language Model

source: Fetch all LLMs in the system
fr: Récupérer toutes les Grandes Modèles de Langage dans le système
ja: システム内のすべての Large Language Model を取得します
ru: Получить все Large Language Model в системе

source: All Embeddings
fr: Tous les plongements
ja: すべての埋め込みモデル
ru: Все эмбеддинги

source: Fetch all embeddings models in the system
fr: Récupérer tous les modèles de plongement dans le système
ja: システム内のすべての埋め込みモデルを取得します
ru: Получить все модели эмбеддингов в системе

source: All Rerankers
fr: Tous les réordonnanceurs
ja: すべての再ランキングモデル
ru: Все переранжировщики

source: Fetch all rerankers in the system
fr: Récupérer tous les réordonnanceurs dans le système
ja: システム内のすべての再ランキングモデルを取得します
ru: Получить все переранжировщики в системе

source: All Data Sources
fr: Toutes les sources de données
ja: すべてのデータソース
ru: Все источники данных

source: Fetch all data sources in the system
fr: Récupérer toutes les sources de données dans le système
ja: システム内のすべてのデータソースを取得します
ru: Получить все источники данных в системе

source: All Agents
fr: Tous les Agents
ja: すべてのエージェント
ru: Все Агенты

source: Fetch all agents in the system
fr: Récupérer tous les Agents dans le système
ja: システム内のすべてのエージェントを取得します
ru: Получить всех Агентов в системе

source: All Knowledge Spaces
fr: Tous les espaces de connaissances
ja: すべての知識空間
ru: Все пространства знаний

source: Fetch all knowledge spaces in the system
fr: Récupérer tous les espaces de connaissances dans le système
ja: システム内のすべての知識空間を取得する
ru: Получить все пространства знаний в системе

source: AWEL Flow Serve Configurations
fr: Configurations du service de flux AWEL
ja: AWEL フローサービス設定
ru: Конфигурации сервиса потоков AWEL

source: This configuration is for the flow serve module.
fr: Cette configuration est destinée au module de service de flux.
ja: この設定はフローサービスモジュール用です。
ru: Эта конфигурация предназначена для модуля сервиса потоков.

source: Interval to load dbgpts from installed packages
fr: Intervalle pour charger les DB-GPT à partir des packages installés
ja: インストール済みパッケージから DB-GPT を読み込む間隔
ru: Интервал для загрузки DB-GPT из установленных пакетов

source: The key to encrypt the data
fr: La clé pour chiffrer les données
ja: データを暗号化するためのキー
ru: Ключ для шифрования данных
