Repository: eosphoros-ai/DB-GPT
Catalog: i18n/locales/*/LC_MESSAGES/dbgpt_core.po
Languages: fr, ja, ru

source: Dict Http Body
fr: Corps HTTP au format dictionnaire
ja: 辞書型 HTTP ボディ
ru: Словарь HTTP-тела

source: Parse the request body as a dict or response body as a dict
fr: Analyser le corps de la requête ou de la réponse sous forme de dictionnaire
ja: リクエストボディまたはレスポンスボディを辞書型として解析します
ru: Разобрать тело запроса как словарь или тело ответа как словарь

source: String Http Body
fr: Corps HTTP au format chaîne de caractères
ja: 文字列型 HTTP ボディ
ru: Строка HTTP-тела

source: Parse the request body as a string or response body as string
fr: Analyser le corps de la requête ou de la réponse sous forme de chaîne de caractères
ja: リクエストボディまたはレスポンスボディを文字列として解析します
ru: Разобрать тело запроса как строку или тело ответа как строку

source: Request Http Body
fr: Corps de la requête HTTP
ja: リクエスト HTTP ボディ
ru: Тело HTTP-запроса

source: Parse the request body as a starlette Request
fr: Analyser le corps de la requête en tant que requête Starlette
ja: リクエストボディを Starlette の Request オブジェクトとして解析します
ru: Разобрать тело запроса как запрос Starlette

source: Common LLM Http Request Body
fr: Corps de la requête HTTP LLM standard
ja: 共通 LLM HTTP リクエストボディ
ru: Общее тело HTTP-запроса для LLM

source: Parse the request body as a common LLM http body
fr: Analyser le corps de la requête en tant que corps de requête HTTP LLM standard
ja: リクエストボディを共通 LLM HTTP ボディとして解析します
ru: Разобрать тело запроса как общее тело HTTP-запроса для LLM

source: Common LLM Http Response Body
fr: Corps de la réponse HTTP LLM standard
ja: 共通 LLM HTTP レスポンスボディ
ru: Общее тело HTTP-ответа для LLM

source: Parse the response body as a common LLM http body
fr: Analyser le corps de la réponse en tant que corps HTTP LLM standard
ja: レスポンスボディを共通 LLM HTTP ボディとして解析します
ru: Разобрать тело ответа как общее тело HTTP-ответа для LLM

source: API Endpoint
fr: Point de terminaison API
ja: API エンドポイント
ru: Конечная точка API

source: The API endpoint
fr: Le point de terminaison de l'API
ja: API エンドポイント
ru: Конечная точка API

source: Http Methods
fr: Méthodes HTTP
ja: HTTP メソッド
ru: HTTP-методы

source: The methods of the API endpoint
fr: Les méthodes du point de terminaison de l'API
ja: API エンドポイントのメソッド
ru: Методы конечной точки API

source: HTTP Method PUT
fr: Méthode HTTP PUT
ja: HTTP メソッド PUT
ru: HTTP-метод PUT

source: HTTP Method POST
fr: Méthode HTTP POST
ja: HTTP メソッド POST
ru: HTTP-метод POST

source: HTTP Method GET
fr: Méthode HTTP GET
ja: HTTP メソッド GET
ru: HTTP-метод GET

source: HTTP Method DELETE
fr: Méthode HTTP DELETE
ja: HTTP メソッド DELETE
ru: HTTP-метод DELETE

source: Streaming Response
fr: Réponse en flux continu
ja: ストリーミング応答
ru: Потоковый ответ

source: Whether the response is streaming
fr: Indique si la réponse est en flux continu
ja: 応答がストリーミングかどうか
ru: Является ли ответ потоковым

source: Http Response Body
fr: Corps de la réponse HTTP
ja: HTTP 応答ボディ
ru: Тело HTTP-ответа

source: The response body of the API endpoint
fr: Le corps de la réponse de l'API
ja: API エンドポイントのレスポンスボディ
ru: Тело ответа API-эндпоинта

source: Response Media Type
fr: Type de média de la réponse
ja: レスポンスメディアタイプ
ru: Тип медиа-ответа

source: The response media type
fr: Le type de média de la réponse
ja: レスポンスのメディアタイプ
ru: Тип медиа-ответа

source: Http Status Code
fr: Code d'état HTTP
ja: HTTP ステータスコード
ru: HTTP-код состояния

source: The http status code
fr: Le code d'état HTTP
ja: HTTP のステータスコード
ru: HTTP-код состояния

source: Dict Http Trigger
fr: Déclencheur HTTP Dict
ja: Dict HTTP トリガー
ru: Словарь HTTP-триггера

source: Trigger your workflow by http request, and parse the request body as a dict
fr: Déclenchez votre flux de travail par une requête HTTP et analysez le corps de la requête en tant que dictionnaire
ja: HTTP リクエストでワークフローをトリガーし、リクエストボディを辞書として解析します
ru: Запустите свой рабочий процесс с помощью HTTP-запроса и распарсите тело запроса в виде словаря

source: Request Body
fr: Corps de la requête
ja: リクエストボディ
ru: Тело запроса

source: The request body of the API endpoint
fr: Le corps de la requête du point d'accès de l'API
ja: API エンドポイントのリクエストボディ
ru: Тело запроса конечной точки API

source: String Http Trigger
fr: Déclencheur HTTP de chaîne
ja: 文字列 HTTP トリガー
ru: Строковый HTTP-триггер

source: Trigger your workflow by http request, and parse the request body as a string
fr: Déclenchez votre flux de travail via une requête HTTP et analysez le corps de la requête en tant que chaîne
ja: HTTP リクエストでワークフローをトリガーし、リクエストボディを文字列として解析します
ru: Запустите свой рабочий процесс с помощью HTTP-запроса и распарсите тело запроса как строку

source: The request body of the API endpoint, parse as a json string
fr: Le corps de la requête de l'API, analysé en tant que chaîne JSON
ja: API エンドポイントのリクエストボディを JSON 文字列として解析します
ru: Тело запроса конечной точки API, распарсить как JSON-строку

source: Common LLM Http Trigger
fr: Déclencheur HTTP LLM courant
ja: 一般的な LLM HTTP トリガー
ru: Общий HTTP-триггер LLM

source: Trigger your workflow by http request, and parse the request body as a common LLM http body
fr: Déclenchez votre flux de travail via une requête HTTP et analysez le corps de la requête en tant que corps HTTP LLM standard
ja: HTTP リクエストでワークフローをトリガーし、リクエストボディを一般的な LLM HTTP ボディとして解析します
ru: Запустите свой рабочий процесс с помощью HTTP-запроса и распарсите тело запроса как общее HTTP-тело LLM

source: The request body of the API endpoint, parse as a common LLM http body
fr: Le corps de la requête de l'API, analysé en tant que corps HTTP LLM standard
ja: API エンドポイントのリクエストボディを一般的な LLM HTTP ボディとして解析します
ru: Тело запроса конечной точки API, распарсить как общее HTTP-тело LLM

source: Request String Messages
fr: Messages de chaîne de la requête
ja: リクエスト文字列メッセージ
ru: Запрос на строковые сообщения

source: The request string messages of the API endpoint, parsed from 'messages' field of the request body
fr: Les messages de chaîne de la requête de l'API, extraits du champ 'messages' du corps de la requête
ja: APIエンドポイントのリクエスト文字列メッセージは、リクエストボディの 'messages' フィールドから解析されます
ru: Строковые сообщения запроса конечной точки API, распарсенные из поля 'messages' тела запроса

source: Example Http Response
fr: Exemple de réponse HTTP
ja: 例：HTTPレスポンス
ru: Пример HTTP-ответа

source: Example Http Request
fr: Exemple de requête HTTP
ja: 例：HTTPリクエスト
ru: Пример HTTP-запроса

source: Example Http Hello Operator
fr: Exemple d'opérateur HTTP Bonjour
ja: 例：HTTPハローオペレーター
ru: Пример HTTP-оператора приветствия

source: Http Request Body
fr: Corps de la requête HTTP
ja: HTTPリクエストボディ
ru: HTTP-тело запроса

source: The request body of the API endpoint(Dict[str, Any])
fr: Le corps de la requête de l'API (Dict[str, Any])
ja: APIエンドポイントのリクエストボディ (Dict[str, Any])
ru: Тело запроса API-точки доступа (Dict[str, Any])

source: Response Body
fr: Corps de la réponse
ja: レスポンスボディ
ru: Тело ответа

source: Request Body To Dict Operator
fr: Opérateur pour convertir le corps de la requête en dictionnaire
ja: リクエストボディを辞書に変換するオペレーター
ru: Оператор преобразования тела запроса в словарь

source: Prefix Key
fr: Clé préfixe
ja: プレフィックスキー
ru: Префиксный ключ

source: The prefix key of the dict, link 'message' or 'extra.info'
fr: La clé préfixe du dictionnaire, comme 'message' ou 'extra.info'
ja: 辞書のプレフィックスキー、例えば 'message' や 'extra.info'
ru: Префиксный ключ словаря, например 'message' или 'extra.info'

source: User Input Parsed Operator
fr: Opérateur d'analyse de l'entrée utilisateur
ja: ユーザー入力解析オペレーター
ru: Оператор разбора пользовательского ввода

source: Key
fr: Clé
ja: キー
ru: Ключ

source: The key of the dict, link 'user_input'
fr: La clé du dictionnaire, comme 'user_input'
ja: 辞書のキー、例えば 'user_input'
ru: Ключ словаря, например 'user_input'

source: User Input Dict
fr: Dictionnaire d'entrée utilisateur
ja: ユーザー入力辞書
ru: Словарь пользовательского ввода

source: The user input dict of the API endpoint
fr: Le dictionnaire d'entrée utilisateur de l'API
ja: API エンドポイントのユーザー入力辞書
ru: Словарь пользовательского ввода для конечной точки API

source: User input parsed operator, parse the user input from request body and return as a dict
fr: Opérateur d'analyse de l'entrée utilisateur, analyse l'entrée utilisateur à partir du corps de la requête et la retourne sous forme de dictionnaire
ja: ユーザー入力解析オペレーター、リクエストボディからユーザー入力を解析して辞書として返す
ru: Оператор разбора пользовательского ввода, который разбирает пользовательский ввод из тела запроса и возвращает в виде словаря

source: Request Body Parsed To String Operator
fr: Opérateur de conversion du corps de la requête en chaîne
ja: リクエストボディを文字列に解析するオペレーター
ru: Оператор преобразования тела запроса в строку

source: User Input String
fr: Chaîne d'entrée utilisateur
ja: ユーザー入力文字列
ru: Строка пользовательского ввода

source: User input parsed operator, parse the user input from request body and return as a string
fr: Opérateur d'analyse de l'entrée utilisateur, qui extrait l'entrée utilisateur du corps de la requête et la renvoie sous forme de chaîne de caractères
ja: ユーザー入力解析オペレーター、リクエストボディからユーザー入力を解析して文字列として返す
ru: Оператор разбора пользовательского ввода, который разбирает пользовательский ввод из тела запроса и возвращает в виде строки

source: Request Http Trigger
fr: Déclencheur HTTP de requête
ja: HTTP リクエストトリガー
ru: Триггер HTTP-запроса

source: Trigger your workflow by http request, and parse the request body as a starlette Request
fr: Déclenchez votre flux de travail via une requête HTTP et analysez le corps de la requête comme une requête Starlette
ja: HTTP リクエストでワークフローをトリガーし、リクエストボディを Starlette の Request として解析する
ru: Запустите свой рабочий процесс с помощью HTTP-запроса и разбирайте тело запроса как объект starlette Request

source: The request body of the API endpoint, parse as a starlette Request
fr: Le corps de la requête du point de terminaison de l'API, analysé comme une requête Starlette
ja: API エンドポイントのリクエストボディを Starlette の Request として解析する
ru: Тело запроса конечной точки API, разбираемое как объект starlette Request

source: HTTP Sender
fr: Émetteur HTTP
ja: HTTP 送信者
ru: Отправитель HTTP-запросов

source: Send a HTTP request to a specified endpoint
fr: Envoyez une requête HTTP à un point de terminaison spécifié
ja: 指定されたエンドポイントに HTTP 要求を送信する
ru: Отправить HTTP-запрос на указанную конечную точку

source: The request body to send
fr: Le corps de la requête à envoyer
ja: 送信するリクエストボディ
ru: Тело запроса для отправки

source: The response body of the HTTP request
fr: Le corps de la réponse de la requête HTTP
ja: HTTP リクエストのレスポンスボディ
ru: Тело ответа HTTP-запроса

source: HTTP Address
fr: Adresse HTTP
ja: HTTP アドレス
ru: HTTP-адрес

source: address
fr: adresse
ja: アドレス
ru: адрес

source: The address to send the HTTP request to
fr: L'adresse à laquelle envoyer la requête HTTP
ja: HTTP リクエストを送信するアドレス
ru: Адрес, на который отправляется HTTP-запрос

source: Timeout
fr: Délai d'expiration
ja: タイムアウト
ru: Тайм-аут

source: The timeout of the HTTP request in seconds
fr: Le délai d'expiration de la requête HTTP en secondes
ja: HTTP リクエストのタイムアウト（秒単位）
ru: Тайм-аут HTTP-запроса в секундах

source: Token
ja: トークン
ru: Токен

source: The token to use for the HTTP request
fr: Le token à utiliser pour la requête HTTP
ja: HTTP リクエストに使用するトークン
ru: Токен, используемый для HTTP-запроса

source: Cookies
ja: クッキー
ru: Куки

source: The cookies to use for the HTTP request
fr: Les cookies à utiliser pour la requête HTTP
ja: HTTP リクエストに使用するクッキー
ru: Куки, используемые для HTTP-запроса

source: Conversation Composer Operator
fr: Opérateur de composition de conversation
ja: 会話コンポーザー演算子
ru: Оператор составления диалога

source: A composer operator for conversation. Including chat history handling, prompt composing, etc. Output is ModelRequest.
fr: Un opérateur de composition pour la conversation. Y compris la gestion de l'historique des conversations, la composition des invites, etc. La sortie est ModelRequest.
ja: 会話用のコンポーザー演算子です。 チャット履歴の処理やプロンプトの作成などを行い、出力は ModelRequest です。
ru: Оператор составления диалога. Включает обработку истории чата, составление промптов и т.д. Выход - ModelRequest.

source: Prompt Template
fr: Modèle d'invite
ja: プロンプトテンプレート
ru: Шаблон промпта

source: The prompt template for the conversation.
fr: Le modèle d'invite pour la conversation.
ja: 会話用のプロンプトテンプレートです。
ru: Шаблон промпта для диалога.

source: Human Message Key
fr: Clé du message humain
ja: ユーザーメッセージキー
ru: Ключ для сообщения человека

source: The key for human message in the prompt format dict.
fr: La clé pour le message humain dans le dictionnaire de format de l'invite.
ja: プロンプト形式の辞書におけるユーザーメッセージのキーです。
ru: Ключ для сообщения человека в словаре формата промпта.

source: History Key
fr: Clé d'historique
ja: 履歴キー
ru: Ключ истории

source: The chat history key, with chat history message pass to prompt template.
fr: La clé de l'historique de conversation, avec les messages de l'historique de conversation transmis au modèle d'invite.
ja: チャット履歴キーで、チャット履歴メッセージがプロンプトテンプレートに渡されます。
ru: Ключ истории чата, с помощью которого сообщения истории чата передаются в шаблон промпта.

source: Keep Start Rounds
fr: Conserver les premiers tours
ja: 開始ラウンドを保持
ru: Сохранять начальные раунды

source: The start rounds to keep in the chat history.
fr: Les premiers tours à conserver dans l'historique de conversation.
ja: チャット履歴に保持する開始ラウンド。
ru: Начальные раунды, которые нужно сохранить в истории чата.

source: Keep End Rounds
fr: Conserver les derniers tours
ja: 終了ラウンドを保持
ru: Сохранять конечные раунды

source: The end rounds to keep in the chat history.
fr: Les derniers tours à conserver dans l'historique de conversation.
ja: チャット履歴に保持する終了ラウンド。
ru: Конечные раунды, которые нужно сохранить в истории чата.

source: Conversation Storage
fr: Stockage des conversations
ja: 会話ストレージ
ru: Хранилище диалогов

source: The conversation storage(Not include message detail).
fr: Le stockage des conversations (ne comprend pas les détails des messages).
ja: 会話ストレージ（メッセージ詳細を含まない）。
ru: Хранилище диалогов (не включает детали сообщений).

source: Message Storage
fr: Stockage des messages
ja: メッセージストレージ
ru: Хранилище сообщений

source: The message storage.
fr: Le stockage des messages.
ja: メッセージストレージ。
ru: Хранилище сообщений.

source: The common LLM http request body.
fr: Le corps de la requête HTTP LLM courante.
ja: 一般的な LLM の HTTP リクエストボディ。
ru: Общее тело HTTP-запроса для LLM.

source: Model Request
fr: Requête de modèle
ja: モデルリクエスト
ru: Запрос к модели

source: The model request with chat history prompt.
fr: La requête de modèle avec l'invite basée sur l'historique des conversations.
ja: チャット履歴のプロンプト付きのモデルリクエスト。
ru: Запрос к модели с подсказкой на основе истории чата.

source: Prompt Format Dict Builder Operator
fr: Opérateur de construction du dictionnaire de format de prompt
ja: プロンプトフォーマット辞書ビルダーオペレータ
ru: Оператор для создания словаря формата подсказки

source: A operator to build prompt format dict from common LLM http request body.
fr: Un opérateur pour construire un dictionnaire de format de prompt à partir du corps de la requête HTTP LLM courante.
ja: 一般的な LLM の HTTP リクエストボディからプロンプトフォーマット辞書を構築するオペレータ。
ru: Оператор для создания словаря формата подсказки из общего тела HTTP-запроса для LLM.

source: Prompt Format Dict
fr: Dictionnaire de format de prompt
ja: プロンプト形式辞書
ru: Словарь формата подсказки

source: The prompt format dict.
fr: Le dictionnaire de format de prompt.
ja: プロンプト形式辞書。
ru: Словарь формата подсказки.

source: Merge String to Dict Operator
fr: Opérateur de fusion de chaîne en dictionnaire
ja: 文字列を辞書に結合するオペレーター
ru: Оператор объединения строки в словарь

source: Merge two strings to a dict, the fist string which is the value from first upstream is the value of the key `first_key`, the second string which is the value from second upstream is the value of the key `second_key`.
fr: Fusionner deux chaînes en un dictionnaire, la première chaîne qui est la valeur du premier flux amont est la valeur de la clé `first_key`, la deuxième chaîne qui est la valeur du deuxième flux amont est la valeur de la clé `second_key`.
ja: 2つの文字列を辞書に結合します。最初の上流からの値である最初の文字列は、キー `first_key` の値となり、2番目の上流からの値である2番目の文字列は、キー `second_key` の値となります。
ru: Объединить две строки в словарь. Первая строка, являющаяся значением из первого источника данных, становится значением ключа `first_key`, вторая строка, являющаяся значением из второго источника данных, становится значением ключа `second_key`.

source: First Key
fr: Première clé
ja: 最初のキー
ru: Первый ключ

source: The key for the first string, default is `user_input`.
fr: La clé pour la première chaîne, par défaut `user_input`.
ja: 最初の文字列のキーで、デフォルトは `user_input` です。
ru: Ключ для первой строки, по умолчанию `user_input`.

source: Second Key
fr: Deuxième clé
ja: 2番目のキー
ru: Второй ключ

source: The key for the second string, default is `context`.
fr: La clé pour la deuxième chaîne, la valeur par défaut est `context`.
ja: 2番目の文字列のキーで、デフォルトは `context` です。
ru: Ключ для второй строки, по умолчанию `context`.

source: First String
fr: Première chaîne
ja: 最初の文字列
ru: Первая строка

source: The first string from first upstream.
fr: La première chaîne provenant du premier flux en amont.
ja: 最初のアップストリームから取得される最初の文字列。
ru: Первая строка от первого источника данных.

source: Second String
fr: Deuxième chaîne
ja: 2番目の文字列
ru: Вторая строка

source: The second string from second upstream.
fr: La deuxième chaîne provenant du deuxième flux en amont.
ja: 2番目のアップストリームから取得される2番目の文字列。
ru: Вторая строка от второго источника данных.

source: Output
fr: Sortie
ja: 出力
ru: Вывод

source: The merged dict. example: {'user_input': 'first', 'context': 'second'}.
fr: Le dictionnaire fusionné. Exemple : {'user_input': 'premier', 'context': 'deuxième'}.
ja: 結合された辞書。例：{'user_input': '最初', 'context': '2番目'}。
ru: Объединенный словарь. Пример: {'user_input': 'first', 'context': 'second'}.

source: Base Output Operator
fr: Opérateur de sortie de base
ja: 基本出力オペレーター
ru: Базовый оператор вывода

source: The base LLM out parse.
fr: L'analyse de sortie de base du LLM.
ja: 基本的な LLM 出力解析。
ru: Базовый парсер вывода LLM.

source: Model Output
fr: Sortie du modèle
ja: モデル出力
ru: Вывод модели

source: The model output of upstream.
fr: La sortie du modèle en amont.
ja: 上流のモデル出力。
ru: Вывод модели от предыдущего этапа.

source: The model output after parsing.
fr: La sortie du modèle après analyse.
ja: 解析後のモデル出力。
ru: Вывод модели после разбора.

source: SQL Output Parser
fr: Analyseur de sortie SQL
ja: SQL 出力パーサー
ru: Парсер вывода SQL

source: Parse the SQL output of an LLM call.
fr: Analyser la sortie SQL d'un appel LLM.
ja: LLM 呼び出しの SQL 出力を解析します。
ru: Разобрать вывод SQL от вызова LLM.

source: Dict SQL Output
fr: Sortie SQL sous forme de dictionnaire
ja: 辞書型 SQL 出力
ru: Вывод SQL в виде словаря

source: The dict output after parsing.
fr: Le dictionnaire de sortie après analyse.
ja: 解析後の辞書型出力。
ru: Вывод в виде словаря после разбора.

source: SQL List Output Parser
fr: Analyseur de liste de sortie SQL
ja: SQL リスト出力パーサー
ru: Парсер вывода списка SQL

source: Parse the SQL list output of an LLM call, mostly used for dashboard.
fr: Analyser la sortie sous forme de liste SQL d'un appel LLM, principalement utilisée pour le tableau de bord.
ja: LLM 呼び出しの SQL リスト出力を解析します。主にダッシュボード用です。
ru: Разобрать вывод списка SQL от вызова LLM, в основном используется для панели мониторинга.

source: List SQL Output
fr: Liste de sortie SQL
ja: リスト型 SQL 出力
ru: Вывод SQL в виде списка

source: The list output after parsing.
fr: La liste de sortie après analyse.
ja: 解析後のリスト出力。
ru: Список вывода после разбора.

source: Memory Storage
fr: Stockage en mémoire
ja: メモリ ストレージ
ru: Память хранения

source: Save your data in memory.
fr: Enregistrez vos données en mémoire.
ja: データをメモリに保存します。
ru: Сохраняйте свои данные в памяти.

source: Serializer
fr: Sérialiseur
ja: シリアライザ
ru: Сериализатор

source: The serializer for serializing the data. If not set, the default JSON serializer will be used.
fr: Le sérialiseur pour sérialiser les données. Si non défini, le sérialiseur JSON par défaut sera utilisé.
ja: データをシリアル化するシリアライザ。設定されていない場合は、デフォルトの JSON シリアライザが使用されます。
ru: Сериализатор для сериализации данных. Если не установлен, будет использован стандартный JSON-сериализатор.

source: The name of the model.
fr: Le nom du modèle.
ja: モデルの名前。
ru: Название модели.

source: The provider of the model. If model is deployed in local, this is the inference type. If model is deployed in third-party service, this is platform name('proxy/<platform>')
fr: Le fournisseur du modèle. Si le modèle est déployé localement, il s'agit du type d'inférence. Si le modèle est déployé sur un service tiers, il s'agit du nom de la plateforme ('proxy/<plateforme>')
ja: モデルのプロバイダー。モデルがローカルにデプロイされている場合、これは推論タイプです。モデルがサードパーティのサービスにデプロイされている場合、これはプラットフォーム名（'proxy/<プラットフォーム>'）です。
ru: Поставщик модели. Если модель развернута локально, это тип вывода. Если модель развернута в стороннем сервисе, это имя платформы ('proxy/<платформа>')

source: Show verbose output.
fr: Afficher une sortie détaillée.
ja: 詳細な出力を表示します。
ru: Показать подробный вывод.

source: Model concurrency limit
fr: Limite de concurrence du modèle
ja: モデルの同時実行数制限
ru: Ограничение параллелизма модели

source: The real model name to pass to the provider, default is None. If backend is None, use name as the real model name.
fr: Le véritable nom du modèle à transmettre au fournisseur, la valeur par défaut est None. Si le backend est None, utilisez le nom comme véritable nom du modèle.
ja: プロバイダーに渡す実際のモデル名で、デフォルトは None です。バックエンドが None の場合、名前を実際のモデル名として使用します。
ru: Реальное название модели, которое нужно передать поставщику, по умолчанию None. Если бэкенд равен None, использовать название как реальное название модели.

source: Prompt template. If None, the prompt template is automatically determined from model. Just for local deployment.
fr: Modèle de prompt. Si None, le modèle de prompt est automatiquement déterminé à partir du modèle. Uniquement pour le déploiement local.
ja: プロンプトテンプレート。None の場合、プロンプトテンプレートはモデルから自動的に決定されます。ローカルデプロイのみに適用されます。
ru: Шаблон запроса. Если значение равно None, шаблон запроса автоматически определяется из модели. Это применяется только для локального развертывания.

source: The context length of the model. If None, it is automatically determined from model.
fr: La longueur du contexte du modèle. Si None, elle est automatiquement déterminée à partir du modèle.
ja: モデルのコンテキスト長。None の場合、モデルから自動的に決定されます。
ru: Длина контекста модели. Если значение равно None, она автоматически определяется из модели.

source: Whether to load the model in 8 bits(LLM.int8() algorithm), default is False.
fr: Indique si le modèle doit être chargé en 8 bits (algorithme LLM.int8()), la valeur par défaut est False.
ja: モデルを8ビット（LLM.int8()アルゴリズム）で読み込むかどうか。デフォルトはFalseです。
ru: Загружать ли модель в 8-битном формате (алгоритм LLM.int8()), по умолчанию - нет.

source: Whether to load the model in 4 bits, default is False.
fr: Indique si le modèle doit être chargé en 4 bits, la valeur par défaut est False.
ja: モデルを4ビットで読み込むかどうか。デフォルトはFalseです。
ru: Загружать ли модель в 4-битном формате, по умолчанию - нет.

source: Whether to load the model in 8 bits(LLM.int8() algorithm).
fr: Indique si le modèle doit être chargé en 8 bits (algorithme LLM.int8()).
ja: モデルを8ビット（LLM.int8()アルゴリズム）で読み込むかどうか。
ru: Загружать ли модель в 8-битном формате (алгоритм LLM.int8()).
